[{"slug":"2021-vcric","legacy":true,"title":"Edward Byrne Memorial Justice Assistance Grant Violent Crime Reduction in Illinois Communities Program","summary":"The Illinois Criminal Justice Information Authority is requesting grant proposals for Violent Crime Reduction in Illinois Communities (VCRIC) program grants. A total of $1 million in FFY19 Edward Byrne Memorial Justice Assistance Grant (JAG) funding is available through this solicitation for use over a period of 36 months.","posted":"2021-06-09T00:00:00.000Z","expires":"2021-07-26T00:00:00.000Z","body":"<!-- # Notice of Funding Opportunity: Edward Byrne Memorial Justice Assistance Grant Violent Crime Reduction in Illinois Communities Program -->[LINK TO NOFO PACKET](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-vcric/VCRIC2021NOFOPacket.zip) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting grant proposals for Violent Crime Reduction in Illinois Communities (VCRIC) program grants. A total of \\$1 million in FFY19 Edward Byrne Memorial Justice Assistance Grant (JAG) funding is available through this solicitation for use over a period of 36 months. Grants will support programs designed to reduce violence crime, specifically domestic violence and gun violence.**Application deadline: July 26, 2021.**## Program RequirementsThe Violent Crime Reduction in Illinois Communities Program was established as a funding goal in the 2019-2024 JAG Strategic Plan. Funding will be used to support evidence-informed or promising practices in violent crime reduction initiatives that target underlying drivers of violence and are tailored to the unique characteristics of violence occurring in Illinois’ diverse communities.Proposed programs must address either domestic violence or gun violence. This program requires a collaborative structure. A collaborative is not a separate organization, but rather a partnership or coalition of multiple partner organizations that will work together to successfully meet the goals of the program. The collaborative structure must consist of one applicant taking on the responsibility of being the passthrough entity and entering into an agreement with ICJIA. The other collaborative partners will be program subgrantees. The principles of diversity, equity, and inclusion must be demonstrated in the proposed program among the partners of the collaborative and program activity. Applicants must also include the four principles of procedural justice in their program design. Evidence-informed or promising practice must be implemented in program design and address implementation barriers as they arise. These and other program requirements are described in detail in the full Notice of Funding Opportunity.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, [https://grants.illinois.gov/portal/](https://grants.illinois.gov/portal/), to become eligible to apply for an award. Applicants must be in good standing with all GATA pre-qualification requirements and received approval of the Internal Control Questionnaire (ICQ) SFY22, and Programmatic Risk Assessment, before the execution of the grant agreement.## Eligible ApplicantsEligible applicants must be part of a collaborative partnership. The collaborative must consist of a passthrough entity and subgrantee partner(s). Collaborative partners must be an Illinois government entity or community-based organization that provides either domestic violence services in their communities or focuses on reduction of gun violence and can demonstrate strong ties to the communities they serve. These and other applicant requirements are described in detail in the full Notice of Funding Opportunity.## DeadlineCompleted application materials must be emailed to [CJA.VCRIC2021@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-vcric/mailto:CJA.VCRIC2021@Illinois.gov) by **3:00 p.m. CST, July 26, 2021,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA maximum of \\$1 million in FFY19 JAG funds will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of November 1, 2021, through October 31, 2022. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 3:00 p.m. on June 18, 2021.[VIEW THE TECHNICAL ASSISTANCE WEBINAR RECORDING](https://www.youtube.com/c/IllinoisCriminalJusticeInformationAuthority/featured) {.text-center .ta-link}Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., June 25, 2021.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_a41QcRZ8wIduKJ8) {.text-center .noi-link}## Timeline|                           **Task**                           |                    **Date**                    || :----------------------------------------------------------: | :--------------------------------------------: ||                         NOFO Posted                          |                 June 11, 2021                  ||                Technical Assistance Recording                |                 June 18, 2021                  ||                     Notice of Intent due                     |                 June 25, 2021                  ||              NOFO question submission deadline               |                 July 22, 2021                  ||                     **Applications due**                     |        **3:00 p.m. CST, July 26, 2021**        || Budget Committee review/approval of recommended designations |           Tentative October 21, 2021           ||                      Performance Period                      | Tentative November 1, 2021 to October 31, 2022 |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at [https://bjapmt.ojp.gov](https://bjapmt.ojp.gov).## Required DocumentsThe following documents must be emailed to [CJA.VCRIC2021@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-vcric/mailto:CJA.VCRIC2021@Illinois.gov) by the **3:00 p.m. CST, July 26, 2021**, deadline for application review. Click the links below to download the complete NOFO Packet.- Passthrough - Uniform State Grant Application (Word)- Passthrough - Program Narrative (Word)- Passthrough - Budget/Budget Narrative (Excel)- Passthrough - Exhibit B and E (Word)- Subgrantee - Uniform State Grant Application (Word)- Subgrantee - Program Narrative (Word)- Subgrantee - Budget/Budget Narrative (Excel)[DOWNLOAD ZIP FILE OF NOFO PACKET (INCLUDES ALL REQUIRED APPLICATION DOCUMENTS)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-vcric/VCRIC2021NOFOPacket.zip) {.text-center .nofo-link}## QuestionsQuestions regarding this NOFO may be submitted to [CJA.VCRIC2021@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-vcric/mailto:CJA.VCRIC2021@Illinois.gov) until **11:59 p.m., July 22, 2021**. Questions and responses will be posted at [https://icjia.illinois.gov/gata/](https://icjia.illinois.gov/gata/).## Contact InformationLuisa SalazarIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606[CJA.VCRIC2021@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-vcric/mailto:CJA.VCRIC2021@Illinois.gov)","fundingType":"nofo"},{"slug":"2021-clepd","legacy":true,"title":"SFY22 Community-Law Enforcement and Other First Responder Partnership for Deflection & Substance Use Disorder Treatment Act: Comprehensive Community-Law Enforcement and Other First Responder Response to Drugs Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants supporting a comprehensive community-law enforcement and other first responder response to drugs. Grants will be made with State Fiscal Year 2022 Community-Law Enforcement and Other First Responder Partnership for Deflection & Substance Use Disorder Treatment Act funds.","posted":"2021-06-21T00:00:00.000Z","expires":"2021-07-22T00:00:00.000Z","body":"<!-- # Notice of Funding Opportunity: SFY22 Community-Law Enforcement and Other First Responder Partnership for Deflection & Substance Use Disorder Treatment Act# Comprehensive Community-Law Enforcement and Other First Responder Response to Drugs Program -->[LINK TO NOFO PACKET](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/CLEPDNOFOPacket.zip) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants supporting a comprehensive community-law enforcement and other first responder response to drugs. Grants will be made with State Fiscal Year 2022 Community-Law Enforcement and Other First Responder Partnership for Deflection & Substance Use Disorder Treatment Act funds. A total of $900,000 in funding is available through this solicitation for use over a eight-month period. Grant requests are limited to a minimum of $75,000, and maximum of $150,000.Read this page and [click here for application materials, funding eligibility, and other information](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/CLEPDNOFOPacket.zip).**Application deadline: July 22, 2021, 11:59 pm.**## Program RequirementsApplicants may request funding under one or more categories.**Model 1:** _Post-Overdose Response_: This model features a response initiated by a law enforcement officer/other first responder after emergency administration of medication to reverse overdose. The post-overdose response may be multi-disciplinary and may include the distribution of naloxone if there is no other source of funding, in-person contact, relationship building, and access to treatment. Example: Quick Response Team.**Model 2:** _Self-Referral Response_: This response is initiated by an individual by going to a police station or otherwise contacting a police officer or law enforcement agency or other first responder and acknowledging their own substance misuse and need for treatment. The response offers individuals assistance in obtaining substance use disorder treatment. Examples: Safe Passage, A Way Out.**Model 3:** _Active Outreach Response:_ This response is initiated by a police officer or other first responder through proactive identification of persons likely to misuse substances or have a substance use disorder. Law enforcement intentionally seeks out and identifies individuals who may need help, and a warm handoff is made to a service provider who engages them in treatment.**Model 4:** _Community Engagement Response_: This response is initiated by a police officer or law enforcement agency or other first responder in response to a notification from a community member when no criminal charges are present.**Model 5:** _Officer Intervention Response_: These are commonly referred to as pre-arrest diversion programs. The response occurs when criminal charges are present but held in abeyance or citations issued with requirement of treatment.An Implementing Agency must apply for funds on behalf of a law enforcement agency or other entity as described below. To be eligible for funding, diversion/deflection programs must:- Be run by a municipal law enforcement agency/other first responder agency, county sheriff’s office of this State, Department of State Police, or other law enforcement agency whose officers, by statute, are granted and authorized by Public Act 100-1025 to exercise powers like those conferred upon any peace officer employed by a law enforcement agency of this State. Private and non-profit entities are not eligible to apply.  - An Implementing Agency in this context is a government agency which will apply for the grant, enter into the inter-governmental grant agreement with ICJIA, accept and account for grant funds, and meet all ICJIA reporting and compliance requirements.The law enforcement agency or other first responder, licensed treatment providers, and community members or organizations shall:- Establish a local deflection program plan to make potential clients and referral sources aware of the services available.- Have a plan to coordinate program activities with community agencies in the service area, including substance abuse treatment, medical care and supportive service providers, behavioral health providers, and relevant government agencies.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, [https://grants.illinois.gov/portal/ ](https://grants.illinois.gov/portal/), to become eligible to apply for an award. During pre-qualification, Dun and Bradstreet verifications are performed, including a check of Debarred and Suspended status and good standing with the Secretary of State. Applicants must have completed the GATA pre-qualification process by the date of application.Applicants will also be required to submit a financial and administrative risk assessment utilizing an Internal Controls Questionnaire (ICQ) for SFY21/22 and obtain approval from their cognizant agencies before execution of the grant agreement. Delay in obtaining SFY21/22 ICQ approval will result in a delay in grant execution.[Click here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/5ILCS820CLEPDSubstanceUseDisorderTreatmentAct.pdf) for the Community-Law Enforcement and Other First Responder Partnership for Deflection & Substance Use Disorder Treatment Act## DeadlineCompleted application materials must be emailed to [CJA.CLEDPNOFO@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/mailto:CJA.CLEDPNOFO@Illinois.gov) by **11:59 p.m., July 22, 2021,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants through this funding opportunity will be made with State Fiscal Year 2022 Community-Law Enforcement and Other First Responder Partnership for Deflection &Substance Use Disorder Treatment Act awarded to the Illinois Criminal Justice Information Authority. Award range: $75,000-$150,000.## Period of PerformanceFunding is available for the period of **November 1, 2021 to June 30, 2022**. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support programming for an additional 24 months.## Required Technical Assistance SessionPre-application webinars will be available for viewing beginning at 3:00 p.m. Tuesday, June 29, 2021.- [CLEPD SFY22 Important Information](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/CLEPDSFY2022ImportantInformation.pptx)Information provided during this webinar recording will be unofficial and not binding on the state.## Timeline|                           **Task**                           |     **Date**      || :----------------------------------------------------------: | :---------------: ||                         NOFO Posted                          |   June 22, 2021   ||              NOFO question submission deadline               |   July 15, 2021   ||                     **Applications due**                     | **July 22, 2021** || Budget Committee review/approval of recommended designations | October 21, 2021  ||                      Program start date                      | November 1, 2022  |## ReportingRecipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to [CJA.CLEDPNOFO@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/mailto:CJA.CLEDPNOFO@Illinois.gov) by the **11:59 p.m., Thursday, July 22, 2021**, deadline for application review. Click the links below to download the complete NOFO Packet.- Completed and signed Uniform State Grant Application (PDF).- Completed Program Narrative (Word).- Completed Uniform Budget Template and Budget Narrative (Excel).[DOWNLOAD ZIP FILE OF NOFO PACKET (INCLUDES ALL REQUIRED APPLICATION DOCUMENTS)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/CLEPDNOFOPacket.zip) {.text-center .nofo-link}## QuestionsQuestions regarding this NOFO may be submitted to [CJA.CLEDPNOFO@Illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/mailto:CJA.CLEDPNOFO@Illinois.gov) until **11:59 p.m., July15, 2021.**All substantive questions and responses will be posted. Updates to NOFO materials, and questions from applicants and their responses are revised weekly. [View them here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/q_and_a.docx).Due to the competitive nature of this solicitation, applicants may not discuss this opportunity directly or indirectly with any ICJIA employee other than the respondent of this email address.## Contact InformationLajuana MurphyCriminal Justice SpecialistIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606[Lajuana.Murphy@illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-clepd/mailto:Lajuana.Murphy@illinois.gov)","fundingType":"nofo"},{"slug":"2021-emergency-pilot","legacy":true,"title":"Emergency Summer Violence Response Pilot Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for Emergency Summer Violence Response Pilot grants. Grants will be made with SFY 22 Restore, Reinvest, and Renew (R3) funds.","posted":"2021-05-20T00:00:00.000Z","expires":"2021-06-07T00:00:00.000Z","body":"[LINK TO NOFO PACKET](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/FY22ESVRNOFOPacket.zip) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority (ICJIA) is requesting proposals for Emergency Summer Violence Response Pilot grants. Grants will be made with SFY 22 Restore, Reinvest, and Renew (R3) funds. A total of \\$3 million in funding to increase existing youth development, youth and emerging adult employment and street outreach programming is available through this solicitation for use over a period of 3 months.**Application deadline: 11:59 p.m. on June 7, 2021.**## Program Requirements- They must be currently operating a youth development, youth employment, or street intervention program that can expand quickly over the summer months.- Organizations that have at least two years of experience providing violence prevention, intervention, or reduction services and the capacity and ability to independently operate the program.- Applicants must be serving at least one R3 area within the following cities and regions: Aurora, Bloomington, Champaign, Chicago-Northside, Chicago-Southside, Chicago-Westside, Decatur, East St. Louis, Joliet, Peoria, Rockford, Springfield, Suburban Cook County, Waukegan.Please refer to the [R3 zone map](https://r3.illinois.gov/eligibility) to determine if you are providing services to an R3 area. To find out if an address is within an R3 zone, or to get information on an R3 zone for application purposes, enter the address into the search bar (top left of R3 zone map) or zoom in (+) on the address on the map. Any address appearing in a color-coded, shaded area is within an R3 zone and eligible for funding.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, [https://grants.illinois.gov/portal/](https://grants.illinois.gov/portal/), to become eligible to apply for an award. Applicants must be in good standing with all GATA pre-qualification requirements and received approval of the Internal Control Questionnaire (ICQ) SFY 22, and Programmatic Risk Assessment, before the execution of the grant agreement.## Eligible ApplicantsThis program is limited to:- Organizations currently operating a youth development, youth or emerging adult employment, or street intervention program that can be expanded quickly beginning July 1, 2021, and continuing over the summer months.- Organizations that have at least two years of experience providing violence prevention, intervention, or reduction services and the capacity and ability to independently operate the program. No collaboratives, sub-grantees, or fiscal agents will be accepted.- Applicants must be serving at least one R3 area within the following cities and regions: Aurora, Bloomington, Champaign, Chicago-Northside, Chicago-Southside, Chicago-Westside, Decatur, East St. Louis, Joliet, Peoria, Rockford, Springfield, Suburban Cook County, Waukegan.Please refer to the [R3 zone map](https://r3.illinois.gov/eligibility) to determine if you are providing services to an R3 area. To find out if an address is within an R3 zone, or to get information on an R3 zone for application purposes, enter the address into the search bar (top left) or zoom in (+) on the address on the map. Any address appearing in a color-coded, shaded area is within an R3 zone and eligible for funding.ICJIA grantees and sub-grantees with current R3 funding, July 1, 2021 through September 30, 2021 **are not eligible** to apply.## DeadlineCompleted application materials must be emailed to [cja.summervp@illinois.gov ](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/mailto:cja.summervp@illinois.gov) by **11:59 p.m., June 7, 2021**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a FY22 R3 funds. $3 million will be made available through this funding opportunity. Applicants may request a minimum of $50,000 and a maximum of \\$300,000 in grant funding.## Period of PerformanceFunding is available for the period of July 1 through September 30, 2021. This is a one-time pilot project.## Live, Virtual Bidder’s ConferenceA live virtual bidder’s conference will be held from 10:00 a.m. to 11:30 a.m. on May 27, 2021. [Register here](https://illinois.webex.com/webappng/sites/illinois/meeting/info/eec169a319e444dcb2a1bf15e3179c75?isPopupRegisterView=true).The PowerPoint and sample budget used in the Bidder’s Conference are available [here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/FY22ESVRPPPT-SAMPLEBUDGET.zip).Information provided during this session will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., May 28, 2021.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_esnu4CADf3g4Nz8) {.text-center .noi-link}## Timeline|                              **Task**                              |           **Date**           || :----------------------------------------------------------------: | :--------------------------: ||                            NOFO Posted                             |         May 21, 2021         ||                    Virtual Bidder’s Conference                     |  May 27, 2021 at 10:00 a.m.  ||                        Notice of Intent due                        |         May 28, 2021         ||                 NOFO question submission deadline                  |         June 1, 2021         ||                        **Applications due**                        | **11:59 p.m., June 7, 2021** ||        R3 Board review/approval of recommended designations        |          June 2021           || ICJIA Budget Committee review/approval of recommended designations |          June 2021           ||                         Performance Period                         |  July 1-September 30, 2021   |## ReportingRecipients must submit monthly financial reports, progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the 2 CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.Grantees must maintain records of the actual food costs and how the food supported its program. For events, grantees must maintain records of the event, including receipts for food and other costs and the number of participants.## Required DocumentsThe following documents must be emailed to [cja.summervp@illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/mailto:cja.summervp@illinois.gov) by the **11:59 p.m., June 7, 2021**, deadline for application review. Click the links below to download the complete NOFO Packet.- Uniform State Grant Application (Excel)- Program Narrative (Word)- Budget/Budget Narrative (Excel)[DOWNLOAD ZIP FILE OF NOFO PACKET (INCLUDES ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/FY22ESVRNOFOPacket.zip) {.text-center .noi-link}The Uniform State Grant Application is also available in Word to comply with accessibility requirements. [Click here for that version](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/FY22ESVRAPP.docx).## QuestionsQuestions regarding this NOFO may be submitted to [cja.summervp@illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/mailto:cja.summervp@illinois.gov) until **11:59 p.m., June 1, 2021**. Questions and responses can be [download here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/FY22ESVRPQA.pdf).## Contact InformationReshma DesaiIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606[cja.summervp@illinois.gov](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2021-emergency-pilot/mailto:cja.summervp@illinois.gov)","fundingType":"nofo"},{"slug":"2020-casa","legacy":true,"title":"Victims of Crime Act: Court-Appointed Special Advocate Victim Assistance Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants to support Court Appointed Special Advocate (CASA) Programs across the state. Grants will be made with FFY19 Victims of Crime Act (VOCA) funds.","posted":"2020-10-01T00:00:00.000Z","expires":"2020-10-30T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-casa/CASANOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to support Court Appointed Special Advocate (CASA) Programs across the state. Grants will be made with FFY19 Victims of Crime Act (VOCA) funds. A total of \\$2,535,000 in VOCA funds will support advocates that provide direct services to child victims of abuse and neglect through municipal county CASA programs. Funds are available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 p.m., October 30, 2020.**## Program RequirementsFunding will support CASA Programs. Eligible agencies will be allowed to apply for funding for staffing, staff training, supervision of direct services, and office equipment to create or expand existing victim service programs. Applicants must discuss their histories and capacity to provide services to these groups and fulfill the other requirements outlined in the Notice of Funding Opportunity (NOFO).## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must be in good standing with all GATA pre-qualification requirements and received approval of the Internal Control Questionnaire (ICQ) SFY21, and Programmatic Risk Assessment before the execution of the grant agreement.## Eligible ApplicantsEligible applicants are limited to public agencies and nonprofit organizations with a record of providing effective services. See page 15 of the NOFO for a complete list of eligibility requirements.## DeadlineCompleted application materials must be emailed to CJA.CASA.NOFOffy19@Illinois.gov by **11:59 p.m., October 30, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $2,535,000 million in funding is available through this solicitation. A minimum of $75,000 and a maximum of \\$500,000 will be awarded to successful applicants.## Period of PerformanceFunding is available for the period of January 1, 2021, through December 31, 2021. Based on program performance and fund availability, ICJIA may recommend a funding allocation to support up to an additional 24 months of programming.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at **5:00 p.m. on October 2, 2020.**[View the Technical Assistance Webinar Recording](https://www.youtube.com/watch?v=w4BBJAfno3c) {.text-center .ta-link}Information provided during this webinar recording will be unofficial and not binding on the state.- [General Requirements](https://www.youtube.com/watch?v=PBwekeMT5dk)- [Indirect Costs](https://www.youtube.com/watch?v=4stkASoNY5w##)## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., October 16, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_0iBJNliJ8l28Yu1) {.text-center .noi-link}## Timeline|                           **Task**                           |           **Date**            || :----------------------------------------------------------: | :---------------------------: ||                         NOFO posted                          |        October 1, 2020        ||           Technical Assistance Recording available           |        October 2, 2020        ||                     Notice of Intent due                     |       October 16, 2020        ||              NOFO question submission deadline               |       October 23, 2020        ||                     **Applications due**                     | **11:59pm, October 30, 2020** || Budget Committee review/approval of recommended designations |       December 10, 2020       ||                      Program start date                      |        January 1, 2021        |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to cja.casa.nofoffy19@illinois.gov by the **11:59 p.m., October 30, 2020,** deadline for application review. Click the links below to download the complete NOFO Packet.- Completed and signed Uniform State Grant Application (Word)- Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-casa/CASANOFOZip.zip) {.text-center .zip-link}## QuestionsQuestions regarding this NOFO may be submitted to CJA.CASA.NOFOFFY19@Illinois.gov until **11:59 p.m. October 23, 2020**. Questions and responses are posted [here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-casa/NOFOQ&A.pdf).## Contact InformationRise’ EvansIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.CASA.NOFOFFY19@Illinois.gov","fundingType":"nofo"},{"slug":"2020-voca-victim-assistance","legacy":true,"title":"Victims of Crime Act: Law Enforcement/Prosecution Victim Assistance Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants to support the Law Enforcement/Prosecution Victim Assistance Program. Grants will be made with FFY19 Victims of Crime Act (VOCA) funds.","posted":"2020-09-30T00:00:00.000Z","expires":"2020-10-30T00:00:00.000Z","body":"[LINK TO NOFO INSTRUCTIONS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-victim-assistance/LEProsecutionNOFORevised.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to support the Law Enforcement/Prosecution Victim Assistance Program. Grants will be made with FFY19 Victims of Crime Act (VOCA) funds. A total of \\$2,745,000 in funding will support advocate position(s) to provide direct services (victim de-escalation, emotional support, and case management) to victims at law enforcement agencies or states attorney’s offices. Funded services must be located within the offices of the law enforcement agency or state’s attorney. Funding is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 p.m., October 30, 2020.**## Program RequirementsFunding will support Law Enforcement/Prosecution-Based Victim Assistance Programs. Eligible agencies will be allowed to apply for funding for staffing, staff training, supervision of direct services, and office equipment to create or expand existing victim service programs. Applicants must describe their histories and capacity to provide services to these groups and fulfill the other requirements outlined in this Notice of Funding Opportunity (NOFO).## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must be in good standing with all GATA pre-qualification requirements and received approval of the SFY21 Internal Control Questionnaire (ICQ) and Programmatic Risk Assessment before the execution of the grant agreement.## Eligible ApplicantsEligible applicants are limited to public agencies and nonprofit organizations with a record of providing effective services. See page 14 of the NOFO for a complete list of eligibility requirements.## DeadlineCompleted application materials must be emailed to CJA.LE.NOFOFFY19@Illinois.gov by **11:59 p.m., October 30, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants for this funding opportunity will be made with FFY19 Victims of Crime Act (VOCA) funds. A total of $2,745,000 is available through this solicitation. A minimum of $75,000 and a maximum of \\$350,000 will be awarded to successful applicants.## Period of PerformanceFunding is available for the period of January 1, 2021, through December 31, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support up to an additional 24 months of programming.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing at **5:00 p.m. on October 2, 2020.**[View the Technical Assistance Webinar Recording (Required)](https://www.youtube.com/watch?v=byD9hRn1lB4) {.text-center}Information provided during this webinar recording will be unofficial and not binding on the state.- [General Requirements](https://www.youtube.com/watch?v=PBwekeMT5dk)- [Indirect Costs](https://www.youtube.com/watch?v=4stkASoNY5w##)## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., October 25, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_bHq6wHBFFHJteqF) {.text-center .noi-link}## Timeline|                           **Task**                           |           **Date**            || :----------------------------------------------------------: | :---------------------------: ||                         NOFO posted                          |        October 1, 2020        ||           Technical Assistance Recording available           |        October 2, 2020        ||                     Notice of Intent due                     |       October 23, 2020        ||              NOFO question submission deadline               |       October 21, 2020        ||                     **Applications due**                     | **11:59pm, October 30, 2020** || Budget Committee review/approval of recommended designations |       December 10, 2020       ||                      Program start date                      |        January 1, 2021        |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.LE.NOFOFFY19@Illinois.gov by the **11:59 p.m., October 30, 2020,** deadline for application review. Click the links below to download the complete NOFO Packet.- Completed and signed Uniform State Grant Application (Word)- Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)- Memorandum of Understanding- United States Internal Revenue Service 501(c)(3) determination letter[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-victim-assistance/LEProsecution.zip) {.text-center}## QuestionsQuestions regarding this NOFO may be submitted to CJA.LE.NOFOFFY19@Illinois.gov until **11:59 p.m. October 21, 2020**. Download questions and responses [here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-victim-assistance/LawEnforcementFAQ.docx).## Contact InformationMalea ConroIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.LE.NOFOFFY19@illinois.gov","fundingType":"nofo"},{"slug":"2020-voca-multi-victimization","legacy":true,"title":"Victims of Crime Act Multi-Victimization Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants to support Multi Victimization programs. Grants will be made with FFY19 Victims of Crime Act (VOCA) grant funds appropriated to the Illinois Criminal Justice Information Authority.","posted":"2020-08-31T00:00:00.000Z","expires":"2020-10-05T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-multi-victimization/MultipleVictimizationNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to support Multi-Victimization programs. Grants will be made with FFY19 Victims of Crime Act (VOCA) grant funds appropriated to the Illinois Criminal Justice Information Authority. **Application deadline:  11:59 p.m. on October 5, 2020**## Program RequirementsThe purpose of this Notice of Funding Opportunity (NOFO) is to support direct services to multi-victimization programs. This funding opportunity seeks to address the needs of victims who have experienced multiple types of crime during their lifetime. Experiencing multiple types of crime can result in complex trauma and mental health symptoms that differ from those who experience one type of crime.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://icjia.illinois.gov/gata, to become eligible to apply for an award.  Applicants must have completed the GATA pre-qualification process and received approval of the Internal Control Questionnaire SFY 2021before the execution of the grant agreement. ## Eligible ApplicantsEligible applicants include public agencies and non-profit organizations.## DeadlineCompleted application materials must be emailed to CJA.Multi.NOFOffy19@illinois.gov by **11:59 p.m., October 5, 2020**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA minimum of $12 million will be made available through this funding opportunity.  ## Period of PerformanceFunding is available for the period of December 1, 2020, through November 30, 2021. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support an additional 24 months.  ## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 1:30 p.m. on May 11, 2020.[View the Technical Assistance Webinar Recording](https://youtu.be/seHRXSt-rCg) {.text-center}[View the Technical Assistance powerpoint](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-multi-victimization/MultiVictimizationNOFOSeptember2020.pdf) {.text-center}Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applyingare asked to submit an online Notice of Intent by **11:59 p.m., September 18, 2020**.[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_5BGGflmRFSd3goJ) {.text-center .noi-link}## Timeline|                           **Task**                        |      **Date**      || :-------------------------------------------------------: | :----------------: ||                         NOFO posted                       |   September 1, 2020||             Technical Assistance Recording available      |   September 4, 2020||                      Notice of Intent due                 |  September 18, 2020||                 NOFO question submission deadline   \t\t  |  September 23, 2020||                     **Applications due**                  | **October 5, 2020**||Budget Committee review/approval of recommended designations|   November 2020   | |                      Program start date                   |   December 1, 2020 |         ## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.Multi.NOFOffy19@illinois.gov by the **11:59 p.m., October 5, 2020**, deadline for application review. Click the link below to download copies.- Completed and signed Uniform State Grant Application (Word)- Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-multi-victimization/FFY19MultiVictimization.zip) {.text-center .zip-link}## QuestionsQuestions regarding this NOFO may be submitted to CJA.Multi.NOFOffy19@illinois.gov until 11:59 p.m. on September 23, 2020.  Questions and responses are [posted here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-voca-multi-victimization/VOCA.Multi.Victim.FAQs.docx).## Contact InformationRonnie ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.Multi.NOFOffy19@illinois.gov ","fundingType":"nofo"},{"slug":"2020-coronavirus-supplemental","legacy":true,"title":"Coronavirus Emergency Supplemental Funding","summary":"The Illinois Criminal Justice Information Authority (ICJIA) seeks information from community-based agencies, operating as lead entities, to utilize the U.S. Bureau of Justice Assistance Coronavirus Emergency Supplemental Funding Program in areas disproportionately impacted by the coronavirus pandemic to prevent, prepare for, or respond to the coronavirus. Lead entities distribute funds via sub-grants to their provider networks and are responsible for the fiscal oversight and quality assurance of those sub-grants. Lead entities also conduct structured monitoring of all sub-grantees and provide subject matter expertise and technical assistance to sub-grantees.","posted":"2020-07-08T00:00:00.000Z","expires":"2020-07-24T00:00:00.000Z","body":"[LINK TO RFI](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-coronavirus-supplemental/FFY20COVIDRFI.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority (ICJIA) seeks information from community-based agencies, operating as lead entities, to utilize the U.S. Bureau of Justice Assistance Coronavirus Emergency Supplemental Funding Program in areas disproportionately impacted by the coronavirus pandemic to prevent, prepare for, or respond to the coronavirus. Lead entities distribute funds via sub-grants to their provider networks and are responsible for the fiscal oversight and quality assurance of those sub-grants.**RFI deadline: 11:59 p.m. on July 24, 2020**## Program RequirementsRespondents must focus on at least one program area. 1.\tHousing    - Transitional and/or emergency housing for persons involved in the criminal justice system and/or those who have experienced violence. This may also include rent assistance allowing participants to remain in their existing housing. 2. Supportive Services    - Supportive services for persons involved in the criminal justice system and/or those who have experienced violence. Services include advocacy, case management, legal services, mental and emotional support, clinical behavioral health services (includes substance use treatment) for adults and children.\t\t3.\tAgency Support     - Rent and utilities for community-based agencies operations.    - COVID-19 related supplies and technology.\t\t4.\tFoodbank    - Receive and distribute food to community-based agencies for their participants.\t\t5.\tOther    - See Unallowable Costs section before selecting this option.## Eligibility InformationCommunity-Based Agencies, operating as lead entitiesAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award.  Applicants must have completed the GATA pre-qualification process and received approval of the Internal Control Questionnaire SFY 2021 before the execution of the grant agreement. ## Geographic Focus AreaICJIA will prioritize funding in geographic areas (ZIP codes) where residents are disproportionately impacted by the coronavirus pandemic. Respondents should propose plans to serve geographic areas that best meet this description. ICJIA will review geographic data on positive COVID-19 cases, unemployment, housing, and reentry and determine which proposals best address the issues.  ## DeadlineCompleted respondent materials must be emailed to CJA.COVID@illinois.gov by **11:59 p.m., July 24, 2020,** to be considered for funding. Submissions will not be accepted by mail, fax, or in-person. Incomplete or late submissions will not be reviewed.## Available FundsA total of $7,978,038 is available.   ## Period of PerformanceThese funds will be available for a 12-month period that will start upon grant execution. Funds that extend into State Fiscal Year 2022 are subject to appropriation.   ## Timeline|                           **Task**                        |      **Date**      || :-------------------------------------------------------: | :----------------: ||                         RFI posted                        |   July 10, 2020\t\t ||             RFI question submission deadline              |   July 20, 2020    ||                     **Responses due**                  \t\t| **July 24, 2020**  ||      Budget Committee review/approval of recommended designations|   August 2020  ||                     Program start date                    |  No later than September 2020 |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.COVID@illinois.gov by **11:59 p.m., July 24, 2020,** deadline for review. Click the links below to download copies.- Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-coronavirus-supplemental/FF20COVID.zip) {.text-center .zip-link}## QuestionsSubmit questions to CJA.COVID@illinois.gov until July 20th. Download the latest [questions and answers here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-coronavirus-supplemental/COVIDRFIQandA.pdf).## Contact InformationShai HoffmanIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.COVID@illinois.gov","fundingType":"rfi"},{"slug":"2020-r3-assessment-planning","legacy":true,"title":"R3 Assessment and Planning","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Restore, Reinvest, and Renew (R3) program. Grants will be made with fiscal year 2021 funds made available to a trust fund established by The Cannabis Regulation and Tax Act. A total of $3,150,000 in funding is available through this solicitation for use over a period of approximately 9 months.","posted":"2020-05-14T00:00:00.000Z","expires":"2020-07-20T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-r3-assessment-planning/R3PlanningNOFOINSTRUCTIONS.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Restore, Reinvest, and Renew (R3) program. Grants will be made with fiscal year 2021 funds made available to a trust fund established by The Cannabis Regulation and Tax Act. A total of $3,150,000 in funding is available through this solicitation for use over a period of approximately 9 months. **July 20, 2020 at 11:59 pm.**## Program RequirementsThe Assessment and Planning grant opportunity is available to communities who would like to develop a plan to build capacity within and between organizations to address the R3 Program Priorities most relevant to their communities. These Program Priorities, as established in The Cannabis Regulation and Trust Act, are 1.) Civil Legal Aid, 2.) Economic Development, 3.) Reentry, 4.) Violence Prevention, and 5.) Youth Development.Organizations or collaboratives will develop a clear, well-defined process to assess and identify which of the R3 Program Priorities will be addressed in their communities. A final plan should include participation of community residents and stakeholders; require a unified vision and approach; utilize data and local experience and knowledge to define the community’s needs; and create concrete goals, objectives and performance measures to track progress of the program. The plan also may be used to apply for future funding, and, therefore, should not be directed toward a specific funding source. Refer to the NOFO for ALL Program Requirements.## Eligibility InformationOnly programs serving a designated R3 zone are eligible to receive funding under this NOFO. Information on designated R3 zones is available via the interactive map at [https://r3.illinois.gov/eligibility](https://r3.illinois.gov/eligibility). Applicants must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, [https://grants.illinois.gov/portal/](https://grants.illinois.gov/portal/), to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of the Internal Control Questionnaire (ICQ) SFY 2021, or the most recent fiscal year, before the execution of the grant agreement. Other members of a collaborative application submitted by another organization do not need to satisfy these requirements but must be otherwise eligible to receive state funds (see the Checklist at the bottom of page 1 of the NOFO for more information).   ## DeadlineCompleted application materials must be emailed to CJA.R3Planning@Illinois.gov and must be received by **11:59 p.m., July 20, 2020**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $3,150,000 will be made available through this funding opportunity. Grants available through this funding opportunity are a portion of state FY2021 funds. Funding ranges vary by region and are specified in the NOFO and in the Program Narrative. ## Period of PerformanceFunding is available for the period beginning with grant execution (estimated for September 21, 2020) through June 30, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.  ## Technical Assistance SessionsIt is recommended that applicants view the recordings of at least one of three webinars (links below). Applicants may also view the [webinar slides](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-r3-assessment-planning/R3NOFOWebinar.pdf)- [Webinar #1 (held 5/19/2020 from 2:00 to 3:00 pm)](https://youtu.be/F98-dkr6p-k)- [Webinar #2 (held 5/20/2020 from 2:00 to 3:00 pm)](https://youtu.be/1K3CD8zWKOE)- [Webinar #3 (held 5/21/2020 from 10:00 to 11:00 am)](https://youtu.be/FGYJe3T1xPM)Information provided during these webinar recordings will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., July 6, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_5uKwNBK3Vh5eDnT) {.text-center .noi-link} ## Timeline|                           **Task**                        |      **Date**      || :-------------------------------------------------------: | :----------------: ||                         NOFO Posted                       |   May 18, 2020 \t\t ||                    Webinar Sessions held                  |   May 19-21, 2020  ||            Technical Assistance Recording available       |   May 22, 2020     ||                     Notice of Intent due                  |   July 6, 2020     ||              NOFO question submission deadline            |   July 16, 2020    ||                     **Applications due**                  |**11:59 pm, July 20, 2020**||Estimated date for R3 Board approval of recommended designations|   August 2020 ||Estimated date for Authority Budget Committee approval of recommended designations|   August 2020 ||                      Estimated program start date         | September 21, 2020 |## ReportingRecipients must submit monthly financial reports, quarterly performance data reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs may be required to report performance measures through other means as established by the R3 Board in order to evaluate overall program performance as required by the R3 establishing legislation.## Required DocumentsThe following documents must be emailed to CJA.R3Planning@Illinois.gov by the **11:59 p.m., July 20, 2020,** deadline for application review. Click the links below to download copies.- Download NOFO Instructions (PDF)- Completed and signed Uniform State Grant Application (Word) - Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)]- Completed Certification of Employee Local Residence Form (Word) – Required ONLY if organization is seeking local preference points based on employee local residence.[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-r3-assessment-planning/R3Planning.zip)  {.text-center .noi-link} ## QuestionsQuestions regarding this NOFO may be submitted to CJA.R3Planning@Illinois.gov until **11:59 p.m., July 16, 2020**.  Questions and responses will be posted at [https://r3.illinois.gov/faqs](https://r3.illinois.gov/faqs) and at [https://grants.icjia.cloud](https://grants.icjia.cloud).## Contact InformationMitchell TroupIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.R3Planning@illinois.gov","fundingType":"nofo"},{"slug":"2020-r3-service-delivery","legacy":true,"title":"R3 Service Delivery","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Restore, Reinvest, and Renew (R3) program. Grants will be made with fiscal year 2021 funds made available to a trust fund established by The Cannabis Regulation and Tax Act. A total of $28,350,000 in funding is available through this solicitation for use over a period of approximately 9 months.","posted":"2020-05-14T00:00:00.000Z","expires":"2020-07-20T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-r3-service-delivery/R3ServiceNOFOINSTRUCTIONS.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Restore, Reinvest, and Renew (R3) program. Grants will be made with fiscal year 2021 funds made available to a trust fund established by The Cannabis Regulation and Tax Act. A total of $28,350,000 in funding is available through this solicitation for use over a period of approximately 9 months.  **July 20, 2020 at 11:59 pm.**## Program RequirementsThe Service Delivery grant funding opportunity for the R3 program is intended for organizations who provide services in their communities that address at least one of the five R3 Program Priorities. These Program Priorities, as established in The Cannabis Regulation and Trust Act, are 1.) Civil Legal Aid, 2.) Economic Development, 3.) Reentry, 4.) Violence Prevention, and 5.) Youth Development. Services proposed may be specific to one priority or address multiple priorities in one program. One of the core principles of the R3 program is that the most useful knowledge and experience about the needs of each community reside in the community itself. As such, the R3 program does not specify what services should be provided to address the program priorities. Applicants are asked to clearly explain the proposed program, identify how the proposed program addresses at least one program priority, and identify the goals, objectives, outputs, outcomes, and measurements that will be used to maintain and evaluate the proposed program. Please refer to the NOFO for ALL Program Requirements.## Eligibility InformationOnly programs serving a designated R3 zone are eligible to receive funding under this NOFO. Information on designated R3 zones is available via the interactive map at [https://r3.illinois.gov/eligibility](https://r3.illinois.gov/eligibility). Applicants must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, [https://grants.illinois.gov/portal/](https://grants.illinois.gov/portal/), to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of the Internal Control Questionnaire (ICQ) SFY 2021, or the most recent fiscal year, before the execution of the grant agreement. Other members of a collaborative application submitted by another organization do not need to satisfy these requirements but must be otherwise eligible to receive state funds (see the Checklist at the bottom of page 1 of the NOFO for more information).   ## DeadlineCompleted application materials must be emailed to CJA.R3Service@Illinois.gov and must be received by **11:59 p.m., July 20, 2020**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $28,350,000 will be made available through this funding opportunity. Grants available through this funding opportunity are a portion of state FY2021 funds. Funding ranges vary by region and are specified in the NOFO and in the Program Narrative. ## Period of PerformanceFunding is available for the period beginning with grant execution (estimated for September 21, 2020) through June 30, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.  ## Technical Assistance Sessions It is recommended that applicants view the recordings of at least one of three webinars (links below). - [Webinar #1 (held 5/19/2020 from 2:00 to 3:00 pm)](https://youtu.be/F98-dkr6p-k)- [Webinar #2 (held 5/20/2020 from 2:00 to 3:00 pm)](https://youtu.be/1K3CD8zWKOE)- [Webinar #3 (held 5/21/2020 from 10:00 to 11:00 am)](https://youtu.be/FGYJe3T1xPM)Information provided during these webinar recordings will be unofficial and not binding on the state. ## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., July 6, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_82iTmfysXzy6Nwh)## Timeline|                           **Task**                        |      **Date**      || :-------------------------------------------------------: | :----------------: ||                         NOFO Posted                       |   May 18, 2020 \t\t ||                    Webinar Sessions held                  |   May 19-21, 2020  ||            Technical Assistance Recording available       |   May 22, 2020     ||                     Notice of Intent due                  |   July 6, 2020     ||              NOFO question submission deadline            |   July 16, 2020    ||                     **Applications due**                  |**11:59 pm, July 20, 2020**||Estimated date for R3 Board approval of recommended designations|   August 2020 ||Estimated date for Authority Budget Committee approval of recommended designations|   August 2020 ||                      Estimated program start date         | September 21, 2020 |## ReportingRecipients must submit monthly financial reports, quarterly performance data reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs may be required to report performance measures through other means as established by the R3 Board in order to evaluate overall program performance as required by the R3 establishing legislation.## Required DocumentsThe following documents must be emailed to CJA.R3Service@Illinois.gov by the 11:59 p.m., July 20, 2020, deadline for application review. Click the links below to download copies.- Download NOFO Instructions (PDF)- Completed and signed Uniform State Grant Application (Word) - Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)- Completed Certification of Employee Local Residence Form (Word) – Required ONLY if organization is seeking local preference points based on employee local residence.[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-r3-service-delivery/R3Service.zip)## QuestionsQuestions regarding this NOFO may be submitted to CJA.R3Service@Illinois.gov until 11:59 p.m. July 16, 2020.  Questions and responses will be posted at [https://r3.illinois.gov/faqs](https://r3.illinois.gov/faqs) and at [https://grants.icjia.cloud](https://grants.icjia.cloud).## Contact InformationMitchell TroupIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.R3Service@illinois.gov","fundingType":"nofo"},{"slug":"2020-vawa-trafficking","legacy":true,"title":"Violence Against Women Act Sexual Assault Human Sex Trafficking Services","summary":"TThe Illinois Criminal Justice Information Authority is requesting proposals for grants to improve services for and/or the response to victims of sexual assault in persons who also have experienced human sex trafficking.","posted":"2020-06-07T00:00:00.000Z","expires":"2020-07-10T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawa-trafficking/SASPHSTNOFO.PDF) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to improve services for and/or the response to victims of sexual assault in persons who also have experienced human sex trafficking.**Application deadline: July 10, 2020**## Program RequirementsThe Violence Against Woman ACT (VAWA) Sexual Assault Services for Human Sex Trafficking Program supports nonprofit organizations and rape crisis centers to improve services for and/or the response to victims of sexual assault who have also experienced human sex trafficking.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award.  Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date of October 1, 2020, to be considered for funding. ## Eligible ApplicantsEligible applicants include rape crisis centers and other nonprofit, non-governmental organizations or tribal programs that provide services and related assistance to victims of sexual assault and their families.## DeadlineCompleted application materials must be emailed to CJA.SASPNOFO2020@Illinois.gov by **11:59 p.m., July 10, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants will be made with FFY19 Violence Against Women Act Sexual Assault Services Program funds. A total of $535,000 in funding is available through this solicitation for use over a period of 36 months.## Period of PerformanceFunding is available for the period of October 1, 2020, through September 30, 2021. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support an additional 24 months of programming.    ## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., June 30, 2020.** [Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_eQzzLhlbeTYwIOV) {.text-center .noi-link}## Timeline|                           **Task**                        |      **Date**      || :-------------------------------------------------------: | :----------------: ||                         NOFO Posted                       |   June 8, 2020 \t\t ||                     Notice of Intent due                  |   June 30, 2020    ||              NOFO question submission deadline            |   July 2, 2020     ||                     **Applications due**                  | **July 10, 2020**  ||      Budget Committee approval of recommended designations|   August 20, 2020  ||                     Program start date                    |    October 1, 2020 |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.SASPNOFO2020@Illinois.gov by **11:59 p.m., July 10, 2020,** for review. Click the link to download a ZIP file containing all documents.- NOFO Instructions (PDF)- Completed and signed Uniform State Grant Application (Word) - Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)- Attachment 1[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawa-trafficking/SASPHST.zip) {.text-center .zip-link}## QuestionsQuestions regarding this funding opportunity may be submitted to CJA.SASPNOFO2020@Illinois.gov until 11:59 p.m., July 2, 2020.  Questions and responses will be posted at https://icjia.illinois.gov/gata/.## Contact InformationShataun D. Hailey\tIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.SASPNOFO2020@illinois.gov","fundingType":"nofo"},{"slug":"2020-byrne-drug","legacy":true,"title":"Comprehensive Law Enforcement Response To Drugs","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants to support comprehensive law enforcement responses to drugs.","posted":"2020-05-01T00:00:00.000Z","expires":"2020-06-15T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-byrne-drug/CompLEDrugNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to support comprehensive law enforcement responses to drugs. Grants will be made with FFY17 and FFY18 Edward Byrne Memorial Justice Assistance Grant (JAG) funds. A total of \\$3.5 million in funding will be made available to support the JAG goal of reducing substance misuse and availability in Illinois communities.**Application deadline: 11:59 p.m., June 15, 2020**## Program RequirementsApplicants may request funding under one or more categories of funding. A separate application must be completed for each category.#### Category 1: Law Enforcement Deflection ProgramsTo be eligible for funding, deflection programs must:- Be run by a local law enforcement agency, county sheriff’s department, or a multi-jurisdictional cooperative law enforcement unit for which an Implementing Agency has been identified.  - An Implementing Agency in this context is a government agency which will, on behalf of the multi-jurisdictional unit, apply for the grant, enter into the inter-governmental grant agreement with ICJIA, accept and account for grant funds, and meet all ICJIA reporting and compliance requirements.- Collaborate and partner with other police departments, if needed, to generate a wider pool of participants. Options may include:  - Sheriff’s departments.  - Single police departments that have sufficient volume within their own jurisdiction.  - A collaboration between multiple police departments where one agency serves as the lead and memorandums of understanding exist to show that one department will provide treatment coordination services to other jurisdictions. Partner agencies will refer participants to the lead and benefit from having the program as an option for their communities.- Have a full-time service coordinator. The coordinator will provide screening, intake, assessment of insurance coverage, and case management to program participants, and serve as a liaison with treatment providers to secure placements. The coordinator will also facilitate a “warm handoff” when clients arrive at the treatment center. A warm-handoff features a professional (coordinator, officer or trained volunteer) offering a face-to-face introduction of the client to the treatment provider.- Utilize the self-referral model with outreach. The program coordinator and police department must identify potential participants through community outreach, including speaking engagements to community organizations, churches, and health care providers, and establishing a presence in the community by reaching out in areas where potential participants or their families may be and offering information. The model must include:  - A plan to make potential clients and referral sources aware of the services available.  - A plan to coordinate program activities with community agencies in the service area, including substance abuse treatment, medical care and supportive service providers as well as relevant government agencies.- Provide training of police officers and development of intake protocol. The program must train officers on substance use disorders and the development of a protocol that will be followed when potential participants present at the police department.- Provide follow-up and aftercare. The program must follow-up with participants after treatment to determine if further services or case management are needed.- Provide alternative options for potential participants when treatment beds or services are not available. Ideally, the service coordinator will be able to place participants with treatment providers with whom they have established relationships. If need exceeds the number of available placements, the program must stay engaged with participants, encourage harm reduction strategies, or refer to a health care provider to maintain client contact and manage their needs until services become available.- Deflection community outreach expenses may not exceed 10% of total budget for paid media advertising, including website development.#### Category 2: Drug prosecution unitsTo be eligible for funding, drug prosecution programs must:- Be run by a county state’s attorney’s office or the Office of the State’s Attorney’s Appellate Prosecutor.- Provide a memorandum of understanding demonstrating collaborative involvement with one or more drug trafficking enforcement units (Defined in Category 3).#### Category 3: Multi-Jurisdictional Large-Scale Drug Trafficking EnforcementTo be eligible for funding, drug trafficking enforcement programs must:- Be run by a cooperative unit comprised of three or more law enforcement agencies for which an Implementing Agency has been identified.  - An Implementing Agency in this context is a government agency which will, on behalf of the multi-jurisdictional unit, apply for the grant, enter into the inter-governmental grant agreement with ICJIA, accept and account for grant funds, and meet all ICJIA reporting and compliance requirements.- Have a written interagency agreement between all participating agencies defining activities and responsibilities.- Provide a memorandum of understanding demonstrating collaborative involvement with drug prosecution toward meeting the program’s goals and objectives.- Have a plan of intelligence sharing via computerized networking.- Have a plan for forfeiture sharing, including how funds will be used.- Provide a letter of commitment to staffing the program from each participating agency.- Provide a plan for submitting current task force personnel rosters with updated personnel status for U.S. Bureau of Justice Assistance Center for Task Force Integrity and Leadership training.#### Additional Requirements: Law Enforcement Task ForcesThe U.S. Bureau of Justice Assistance requires every member of a law enforcement drug enforcement unit supported with these funds who is a task force commander, agency executive, task force officer, or other task force member of equivalent rank to complete an online task force training once during the life of the grant award. This training addresses task force effectiveness and other key issues including privacy and civil liberties/rights, task force performance measurement, personnel selection, and task force oversight and accountability. The training is provided free of charge through the U.S. Bureau of Justice Assistance Center for Task Force Integrity and Leadership (www.ctfli.org).In addition, ICJIA will require the submission of task force personnel rosters that include training course completion certificates for all funded task force personnel. Go to www.ctfli.org for more information.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of the Internal Control Questionnaire (ICQ) SFY 21, or the most recent fiscal year, before the execution of the grant agreement.## Eligible ApplicantsEligible applicants are limited to municipalities, counties, and state agencies.## DeadlineCompleted application materials must be emailed to CJA.2020DrugNOFO@Illinois.gov by **11:59 p.m., June 15, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $3.5 million FFY17 and FFY18 Justice Assistance Grants will support this funding opportunity. A minimum of $40,000 and a maximum of \\$700,000.00 will be made available to eligible agencies.## Period of PerformanceFunding is available for the period of October 1, 2020, through September 30, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months of programming.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 2:00 p.m. on May 8, 2020.[View the Technical Assistance Session](https://www.youtube.com/channel/UCtZMzk8D3P4OixYTwsfPeKA) {.text-center .ta-link}Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., June 5, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_1z8dMd19k2AKizj) {.text-center .noi-link}## Timeline|                           **Task**                           |           **Date**            || :----------------------------------------------------------: | :---------------------------: ||                         NOFO Posted                          |          May 1, 2020          ||           Technical Assistance Recording available           |          May 8, 2020          ||                     Notice of Intent due                     |         June 5, 2020          ||              NOFO question submission deadline               |         June 11, 2020         ||                     **Applications due**                     | **11:59 p.m., June 15, 2020** || Budget Committee review/approval of recommended designations |        August 20, 2020        ||                      Program start date                      |        October 1, 2020        |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.2020DrugNOFO@Illinois.gov by the **11:59 p.m., June 15, 2020,** deadline for application review. Click the zip file link below to download copies.- Completed and signed Uniform State Grant Application (Word)- Completed Program Narrative (Word)- Completed Program Narrative (Word)- Completed Program Narrative (Word)- Completed Budget/Budget Narrative (Excel)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-byrne-drug/2020DrugNOFOZip.zip) {.text-center .Zipfile-link}## QuestionsQuestions regarding this NOFO may be submitted to CJA.2020DrugNOFO@Illinois.gov until **11:59 p.m. June 11, 2020**. Questions and responses will be posted at https://icjia.illinois.gov/gata/.Click to [download questions and responses](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-byrne-drug/CompLEDrugNOFOFAQs.pdf).## Contact InformationLuisa SalazarIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.2020DrugNOFO@Illinois.gov","fundingType":"nofo"},{"slug":"2020-trauma-recovery","legacy":true,"title":"Trauma Recovery Centers","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Restore, Reinvest, and Renew (R3) program. Grants will be made with fiscal year 2021 funds made available to a trust fund established by The Cannabis Regulation and Tax Act. A total of $28,350,000 in funding is available through this solicitation for use over a period of approximately 9 months.","posted":"2020-05-07T00:00:00.000Z","expires":"2020-06-07T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-trauma-recovery/SFY21TRCNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to support Trauma Recovery Centers. Grants will be made with state General Revenue funds appropriated to the Illinois Criminal Justice Information Authority in SFY21 for grants related to trauma centers and with FFY18 Victims of Crime Act (VOCA) grant funds.**Application deadline: 11:59 p.m. on June 7, 2020**## Program RequirementsThe purpose of this Notice of Funding Opportunity (NOFO) is to support comprehensive mental health and case management services through implementation of the Trauma Recovery Center (TRC) model. The TRC model serves victims of violent crime and their families in underserved communities with high levels of violence.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of the Internal Control Questionnaire SFY 2021 before the execution of the grant agreement.## Eligible ApplicantsEligible applicants include non-profit entities and public hospitals with a Level I or Level II trauma designation.## DeadlineCompleted application materials must be emailed to cja.SFY21TRCnofo@Illinois.gov by **11:59 p.m., June 7, 2020**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA minimum of \\$4 million will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of August 1, 2020, through June 30, 2021. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 1:30 p.m. on May 11, 2020.[View the Technical Assistance Session](https://www.youtube.com/channel/UCtZMzk8D3P4OixYTwsfPeKA) {.text-center .ta-link}Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., May 22, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_bkigApoM04e6o9D) {.text-center .noi-link}## Timeline|                           **Task**                           |     **Date**     || :----------------------------------------------------------: | :--------------: ||                         NOFO Posted                          |   May 8, 2020    ||           Technical Assistance Recording available           |   May 11, 2020   ||                     Notice of Intent due                     |   May 22, 2020   ||              NOFO question submission deadline               |   May 28, 2020   ||                     **Applications due**                     | **June 7, 2020** || Budget Committee review/approval of recommended designations |    July 2020     ||                      Program start date                      |  August 1, 2020  |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to cja.SFY21TRCnofo@Illinois.gov by the **11:59 p.m., June 7, 2020,** deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-trauma-recovery/SFY21TRCAPPLICATION.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-trauma-recovery/SFY21TRCNARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-trauma-recovery/SFY21TRC.BUDGET.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-trauma-recovery/SFY21TRCZip.zip) {.text-center .Zipfile-link}## QuestionsQuestions regarding this NOFO may be submitted to cja.SFY21TRCnofo@Illinois.gov until **11:59 p.m. on May 28, 2020**.Questions and responses are [available here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-trauma-recovery/ResponsetoSFY21TRCnofoQuestions.doc).## Contact InformationRonnie ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606cja.SFY21TRCnofo@Illinois.gov","fundingType":"nofo"},{"slug":"2020-vawacs","legacy":true,"title":"Violence Against Women Act Culturally Specific Victim Services (VAWACS)","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants to support culturally specific victim services.","posted":"2020-02-10T00:00:00.000Z","expires":"2020-04-30T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawacs/VAWACulturallySpecificNOFO1-SDH.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to support culturally specific victim services.**Application deadline: April 30, 2020**## Program RequirementsThe Violence Against Woman ACT (VAWA) Culturally Specific Program supports nonprofit organizations that focus primarily on culturally specific communities and have experience in the area of sexual assault or domestic violence. The goal of this program is to establish, maintain, and expand sustainable, culturally appropriate services that address the unique needs and challenges of victims of domestic violence and sexual assault from culturally specific communities.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date of July 1, 2020, to be considered for funding.## Eligible ApplicantsEligible applicants include private nonprofit organizations for which the primary purpose of the organization is to provide culturally specific services to one or more of the following racial and ethnic communities: American Indians (including Alaska Natives, Eskimos, and Aleuts), Asians, Native Hawaiians and other Pacific Islanders, Blacks, and Latina.## DeadlineCompleted application materials must be emailed to CJA.VAWA2020@Illinois.gov by **11:59 p.m., April 30, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants will be made with FFY18 Violence Against Women Act funds. A total of \\$300,000 in funding is available through this solicitation for use over a period of 36 months.## Period of PerformanceFunding is available for the period of October 1, 2020, through September 30, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., April 10, 2020**.[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_bsaZQX2yh20n5mR) {.text-center .noi-link}## Timeline|                           **Task**                           |      **Date**      || :----------------------------------------------------------: | :----------------: ||                         NOFO Posted                          | February 10, 2020  ||                     Notice of Intent due                     |   April 10, 2020   ||              NOFO question submission deadline               |   April 23, 2020   ||                     **Applications due**                     | **April 30, 2020** || Budget Committee review/approval of recommended designations |   June 18, 2020    ||                      Program start date                      |  October 1, 2020   |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.VAWA2020@Illinois.gov by the **11:59 p.m., April 30, 2020**, deadline for application review. Click the link to download a ZIP file containing all documents.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawacs/CulturallySpecificApplication.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawacs/CulturallySpecificNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawacs/CulturallySpecificBudget.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-vawacs/CulturallySpecificZip.zip) {.text-center .Zipfile-link}## QuestionsQuestions regarding this funding opportunity may be submitted to CJA.VAWA2020@Illinois.gov until **11:59 p.m. April 23, 2020**. Questions and responses will be posted at https://icjia.illinois.gov/gata/.## Contact InformationShataun D. HaileyIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.VAWA2020@illinois.gov","fundingType":"nofo"},{"slug":"2020-cls-voca","legacy":true,"title":"Notice of Funding Opportunity FFY18 Victims of Crime Act Civil Legal Assistance Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Civil Legal Assistance Program. Grants will be made with FFY18 Victims of Crime Act (VOCA) funds.","posted":"2020-03-15T00:00:00.000Z","expires":"2020-04-17T00:00:00.000Z","body":"<!-- # Notice of Funding Opportunity FFY18 Victims of Crime Act Civil Legal Assistance Program {.text-xs-center .CLS} -->[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/CivilLegalServicesNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Civil Legal Assistance Program. Grants will be made with FFY18 Victims of Crime Act (VOCA) funds. A total of \\$7.3 million in funding for emergency legal services, victims’ rights enforcement, and civil legal services is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 pm, April 17, 2020**## Program RequirementsApplicants will select at least one victim group to service from the following: victims of domestic violence; elder abuse; financial exploitation; human trafficking; and sexual violence. Applicants must discuss their history and capacity to provide services to these groups and fulfill the other requirements outlined in the NOFO.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, April 10, 2020, to be considered for funding.## Eligible ApplicantsEligible applicants are limited to public agencies and nonprofit organizations with a record of providing effective services. See NOFO for a complete list of eligibility requirements.## DeadlineCompleted application materials must be emailed to CJA.CIVILLEGALNOFOFFY18@Illinois.gov by **11:59 p.m., April 17, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a FFY18 Victims of Crime Act fund. A total of $7.3 million in funding is available through this solicitation. A minimum of $150,000 and a maximum of \\$1 million will be awarded to successful applicants.## Period of PerformanceFunding is available for the period of July 1, 2020, through June 30, 2021. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance providing additional information regarding this funding opportunity will be available in a [PowerPoint](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/CivilLegalServicesWebinar.zip).## View The Required Technical Assistance Webinar Recording (Required)- [NOFO Guidelines](https://youtu.be/trg8DIF3T2A)- [General Requirements](https://www.youtube.com/watch?v=PBwekeMT5dk)- [Indirect Costs](https://www.youtube.com/watch?v=4stkASoNY5w)Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., April 10, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_eqGUu5zPBKofoLr) {.text-xs-center .NOI}## Timeline|                           **Task**                           |            **Date**            || :----------------------------------------------------------: | :----------------------------: ||                         NOFO Posted                          |         March 18, 2020         ||           Technical Assistance Recording available           |         March 20, 2020         ||                     Notice of Intent due                     |         April 10, 2020         ||              NOFO question submission deadline               |         April 15, 2020         ||                     **Applications due**                     | **11:59 p.m., April 17, 2020** || Budget Committee review/approval of recommended designations |           June 2020            ||                      Program start date                      |          July 1, 2020          |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.CIVILLEGALNOFOFFY18@Illinois.gov by the **11:59 p.m., April 17, 2020**, deadline for application review. Click the links below to download copies.- [Completed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/NOFO.VOCA.CIVILLEGAL.APPLICATION.docx)- [Completed Program Narrative and Logic Model (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/NOFO.VOCA.CivilLegal.NARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/NOFO.VOCA.CIVILLEGAL.BUDGET.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/CivilLegalServicesZIP.zip.zip) {.text-xs-center .Zip-Docs}## QuestionsQuestions regarding this NOFO may be submitted to CJA.CIVILLEGALNOFOFFY18@Illinois.gov until 11:59 p.m. April 15, 2020. Questions and responses will be posted at https://grants.icjia.cloud.Download [Frequently Asked Questions here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-cls-voca/civil.legal.assistance.faq.docx)### Contact InformationMalea ConroIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.CIVILLEGALNOFOFFY18@Illinois.gov","fundingType":"nofo"},{"slug":"2020-ari-sfy21","legacy":true,"title":"Adult Redeploy Illinois Program Implementation Grants (ARI)","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for Adult Redeploy Illinois Program Implementation grants.","posted":"2020-02-27T00:00:00.000Z","expires":"2020-04-14T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ari-sfy21/ARISFY21NOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for Adult Redeploy Illinois Program Implementation grants. Grants will be made with SFY21 Adult Redeploy Illinois funds. A total of approximately \\$9 million in funding is available through this solicitation for use over a period of 12 months.**Application deadline: April 14, 2020.**## Program RequirementsThis funding opportunity is intended to support local jurisdictions’ efforts to safely divert individuals from prison to more effective and less expensive community-based supervision and services by providing funding and technical assistance. Results expected from ARI include reduced prison admissions, lowered cost to taxpayers, and an end to the expensive and vicious cycle of crime and incarceration. ARI sites must utilize validated assessment instruments, invest in local evidence-based programs and services, report performance measurement data quarterly, reduce by 25% the number of individuals committed to IDOC from a defined target population, and agree to participate in required external evaluations. If the proposed program model for ARI implementation is a problem-solving court (PSC), the jurisdiction must either be certified or in the process of being certified through the Administrative Office of the Illinois Courts (AOIC).## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process by **April 14, 2020** and received approval of their SFY21 Internal Control Questionnaire (ICQ), or the most recent fiscal year available, before the execution of the grant agreement.## Eligible ApplicantsCounty units of government or judicial circuits are eligible to apply for this funding opportunity.## DeadlineCompleted application materials must be emailed to CJA.AdultRedeployNOFO@Illinois.gov by **11:59 p.m., April 14, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsApproximately \\$9 million in SFY21 General Revenue funds will be made available through this funding opportunity.## Period of PerformanceFunding is available to support program activities for the period of July 1, 2020, through June 30, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 3:30 p.m. on March 3, 2020.[VIEW THE REQUIRED TECHNICAL ASSISTANCE WEBINAR RECORDING](https://www.youtube.com/channel/UCtZMzk8D3P4OixYTwsfPeKA) {.text-xs-center .TA}Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., April 6, 2020.**[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_bPpc05teP4IArvn) {.text-xs-center .NOI}## Timeline|                                 **Task**                                 |           **Date**            || :----------------------------------------------------------------------: | :---------------------------: ||                               NOFO Posted                                |       February 27, 2020       ||                 Technical Assistance Recording available                 |         March 3, 2020         ||                           Notice of Intent due                           |       **April 6, 2020**       ||                    NOFO question submission deadline                     |       **April 9, 2020**       ||                           **Applications due**                           | **11:59 p.m. April 14, 2020** || Anticipated Budget Committee review/approval of recommended designations |         June 1, 2020          ||                            Program start date                            |         July 1, 2020          |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.AdultRedeployNOFO@Illinois.gov by the **11:59 p.m., April 14, 2020**, deadline for application review. Click the links below to download copies.- [Completed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ari-sfy21/ARISFY21NOFOApplication.docx)- [Completed Program Narrative and Logic Model (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ari-sfy21/ARISFY21NOFONarrative.docx)- Signed Letters of Support (PDF)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ari-sfy21/ARISFY21Budget.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ari-sfy21/ARISFY21Zip.zip) {.text-center}## QuestionsQuestions regarding this NOFO may be submitted to CJA.AdultRedeployNOFO@Illinois.gov until **11:59 p.m. April 9, 2020**. Questions and responses [are posted here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ari-sfy21/SFY21ARINOFOQuestions.docx).## Contact InformationStacey WoodsIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.AdultRedeployNOFO@Illinois.gov","fundingType":"nofo"},{"slug":"2020-csae","legacy":true,"title":"Crime Strategy Analysis and Evaluation (CSAE)","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for the Crime Strategy Analysis and Evaluation Program. Grants will be made with FFY17 Edward Byrne Memorial Justice Assistance Grant Program funds. A total of $424,053 is available through this solicitation for use over a period of eight months.","posted":"2020-01-30T00:00:00.000Z","expires":"2020-03-02T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-csae/CSAE.NOFO1.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for the Crime Strategy Analysis and Evaluation Program. Grants will be made with FFY17 Edward Byrne Memorial Justice Assistance Grant Program funds. A total of \\$424,053 is available through this solicitation for use over a period of eight months.**Application deadline: 11:59 p.m., March 2, 2020.**## Program RequirementsApplicants must complete deliverables as outlined in the Notice of Funding Opportunity (NOFO) and Program Narrative.**_Research-Based Programs or Practices:_**Applicants are strongly urged to incorporate research-based best practices into their program design, when appropriate. Applicants should identify the research-based practice being proposed for implementation, identify and discuss the research that shows that the practice is effective, discuss the population(s) for which this practice has been shown to be effective, and show that it is appropriate for the proposed target population.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, May 1, 2020 to be considered for funding.## Eligible ApplicantsEligible applicants are limited to- Illinois Statistical Analysis Center## DeadlineCompleted application materials must be emailed to Luisa.Salazar@illinois.gov by **11:59 p.m., March 2, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA minimum of \\$300,000 will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of May 1, 2020, through December 31, 2020. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support an additional 28 months.## Timeline|                           **Task**                           |           **Date**            || :----------------------------------------------------------: | :---------------------------: ||                         NOFO Posted                          |       January 31, 2020        ||              NOFO question submission deadline               |       February 21, 2020       ||                     **Applications due**                     | **11:59 p.m., March 2, 2020** || Budget Committee review/approval of recommended designations |        March 12, 2020         ||                      Program start date                      |          May 1, 2020          |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to Luisa.Salazar@illinois.gov by the **11:59 p.m., March 2, 2020,** deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-csae/CSAE.APPLICATION.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-csae/CSAE.BUDGET.xlsx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-csae/CSAE.NARRATIVE.docx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-csae/CSAE.Zip.zip) {.text-xs-center .Zip-Docs}## QuestionsQuestions regarding this NOFO may be submitted to Luisa.Salazar@illinois.gov until 11:59 p.m. February 21, 2020. Questions and responses will be posted at https://grants.icjia.cloud.### Contact InformationLuisa SalazarIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606Luisa.Salazar@illinois.gov","fundingType":"nofo"},{"slug":"2020-ccts","legacy":true,"title":"Community-Based Centers for Trauma Survivors (CCTS)","summary":"The Illinois Criminal Justice Information Authority is requesting applications for state grants to support community planning processes to develop community-based centers with co-located services designed to meet the needs of trauma survivors.","posted":"2020-01-27T00:00:00.000Z","expires":"2020-02-26T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ccts/SFY20CCTSnofo.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting applications for state grants to support community planning processes to develop community-based centers with co-located services designed to meet the needs of trauma survivors.**Application deadline: 11:59 p.m. on February 26, 2020.**## Program RequirementsThis Notice of Funding Opportunity supports community planning processes to develop community-based centers with co-located services designed to meet the needs of trauma survivors.See NOFO for more information.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, April 13, 2020 to be considered for funding.## Eligible ApplicantsEligible applicants are limited to the following entities that work with communities identified as underserved:- Public schools, to include colleges and universities- Public libraries and library districts- Park districts- Public or non-profit hospitals- Public health departments- Community-based non-profit entities.## DeadlineCompleted application materials must be emailed to cja.FY20CCTSnofo@illinois.gov by **11:59 p.m., February 26, 2020** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of \\$900,000 in state funding is available through this solicitation for use over a period of two and a half months. Grants will be made with State Fiscal Year 2020 General Revenue funds.## Period of PerformanceFunding is available for the period of April 13, 2020, through June 30, 2020.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 3:30 p.m. on January 30, 2020. The recording for this opportunity and those related to other aspects of grant applications can be found on [ICJIA’s YouTube channel](https://www.youtube.com/channel/UCtZMzk8D3P4OixYTwsfPeKA/videos).Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., February 14, 2020.**[Complete NOTICE of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_cOzTMHzlyON4lN3) {.text-xs-center .NOI}## Timeline|                           **Task**                           |       **Date**        || :----------------------------------------------------------: | :-------------------: ||                         NOFO Posted                          |   January 27, 2020    ||           Technical Assistance Recording available           |   January 30, 2020    ||               Non-binding Notice of Intent due               |   February 14, 2020   ||              NOFO question submission deadline               |   February 18, 2020   ||                     **Applications due**                     | **February 26, 2020** || Budget Committee review/approval of recommended designations |      March 2020       ||                      Program start date                      |    April 13, 2020     |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to cja.FY20CCTSnofo@illinois.gov by the 11:59 p.m., February 26, 2020, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ccts/SFY20CCTSApplication.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ccts/ICJIAcctsBudget.xlsx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ccts/CCTSNarrative.docx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ccts/CCTSZip.zip) {.text-xs-center .Zip-Docs}## QuestionsQuestions regarding this NOFO may be submitted to cja.FY20CCTSnofo@illinois.gov until 11:59 p.m. February 14, 2020. Questions and responses are [posted here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2020-ccts/ResponsetoCCTSnofoQuestions.doc).## Contact InformationJason WynkoopIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606cja.FY20CCTSnofo@illinois.gov","fundingType":"nofo"},{"slug":"2019-expand-existing-street","legacy":true,"title":"Notice of Funding Opportunity to Enhance and Expand Existing Street Intervention Programming","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants to Enhance and Expand Existing Street Intervention Programming","posted":"2019-12-16T00:00:00.000Z","expires":"2020-01-16T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-expand-existing-street/NOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants to Enhance and Expand Existing Street Intervention Programming. Grants will be made with SFY20 Violence Prevention and Street Intervention funds. A total of $1,894,653 in funding is available for services provided throughout the State of Illinois (with the exception of the City of Chicago) through this solicitation for use over a period of approximately 3.5 (three and a half) months.**Application deadline: 11:59 p.m., January 16, 2020.**## Program RequirementsThis Notice of Funding Opportunity intends to fund an expansion (additional participants) of an existing Street Intervention program and/or an enhancement (additional services) of an existing Street Intervention program. Applicants must have an existing, active Street Intervention program to be eligible for funding under this NOFO. See NOFO for more information.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, March 15, 2020, to be considered for funding.## Eligible ApplicantsEligible applicants are limited to- Municipalities.- Non-profit entities.## DeadlineCompleted application materials must be emailed to CJA.StateViolencePrevention@Illinois.gov by **11:59 p.m., January 16, 2020,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a SFY20 Violence Prevention and Street Intervention fund.### Period of PerformanceFunding is available for the anticipated period of March 15, 2020 through June 30, 2020. Based on program performance and fund availability, the ICJIA may recommend funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 12:00 p.m. on December 17, 2019.- [NOFO General Requirements](https://www.youtube.com/watch?v=DRRSBXlZ4WY)- [Indirect Cost](https://www.youtube.com/watch?v=4stkASoNY5w&t=3s)Information provided during these webinar recordings will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., January 9, 2020.**[Complete NOTICE of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_1S7fGy9HWSkJ1E9) {.text-xs-center .NOI}## Range of Grant AwardsThe amounts below represent the minimum and maximum grant award amounts the applicant can request.|                        **Geographic**                        | **Minimum Award Amount** | **Maximum Award Amount** || :----------------------------------------------------------: | :----------------------: | :----------------------: || Suburban Cook, DuPage, Kane, Lake, McHenry and Will counties |         $25,000          |         $75,000          ||                        Other counties                        |         $25,000          |         $75,000          |## Timeline|                           **Task**                           |             **Date**             || :----------------------------------------------------------: | :------------------------------: ||                         NOFO Posted                          |        December 16, 2019         ||           Technical Assistance Recording available           |        December 17, 2019         ||                     Notice of Intent due                     |         January 9, 2020          ||              NOFO question submission deadline               |         January 9, 2020          ||                     **Applications due**                     | **11:59 p.m., January 16, 2020** || Budget Committee review/approval of recommended designations |          March 13, 2020          ||               Program start date (approximate)               |          March 15, 2020          |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.StateViolencePrevention@Illinois.gov by the 11:59 p.m., January 16, 2020, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-expand-existing-street/Application.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-expand-existing-street/ProgramNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-expand-existing-street/Budget.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-expand-existing-street/VPSIExpansionZip.zip) {.text-xs-center .Zip-Docs}## QuestionsQuestions regarding this NOFO may be submitted to CJA.StateViolencePrevention@Illinois.gov until 11:59 p.m., January 9, 2020.[Download current applicant questions and responses](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-expand-existing-street/UpdatesandResponsetoApplicantQuestions.pdf).## Contact InformationContact InformationShai HoffmanIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.StateViolencePrevention@Illinois.gov","fundingType":"nofo"},{"slug":"2019-trauma-recovery","legacy":true,"title":"Trauma Recovery Centers","summary":"The Illinois Criminal Justice Information Authority is requesting applications for state grants to establish and enhance trauma recovery centers.","posted":"2019-11-05T00:00:00.000Z","expires":"2019-12-12T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/SFY20TraumaRecoveryCenterNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting applications for state grants to establish and enhance trauma recovery centers.**Application deadline: 11:59 p.m. on December 12, 2019.**## Program RequirementsThis Notice of Funding Opportunity offers two categories:- Category 1: Establish New Trauma Recovery Center- Category 2: Enhance Existing Trauma Recovery Center.Applicants must choose only one category. See NOFO for more information.## Eligibility InformationAgencies must be pre-qualified through the [Grant Accountability and Transparency Act (GATA) Grantee Portal (GATA) Grantee Portal](https://grants.illinois.gov/portal/) to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, February 18, 2020 to be considered for funding.## Eligible ApplicantsEligible applicants are limited to- Public Hospitals with a Level I or Level II trauma designation- Non-profit entities.See NOFO for more information regarding eligibility criteria.## DeadlineCompleted application materials must be emailed to CJA.SFY20NEWTRCNOFO@Illinois.gov by **11:59 p.m., December 12, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $2.2 million in state funding is available through this solicitation for use over a period of five months. Grants will be made with State Fiscal Year 2020 General Revenue funds.### Period of PerformanceFunding is available for the period of February 18, 2020, through June 30, 2020. Based on program performance and fund availability, ICJIA may recommend designation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 3:30 p.m. on November 5, 2019.### [VIEW THE REQUIRED TECHNICAL ASSISTANCE WEBINAR RECORDING](https://youtu.be/KwOyaaTQFNw){.text-center .TA-Webinar}Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., December 3, 2019**.[Complete NOTICE of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_cCpxgR4FeMzYBox) {.text-center}## Timeline|                             Task                             |         Date          || :----------------------------------------------------------: | :-------------------: ||                         NOFO Posted                          |   November 5, 2019    ||           Technical Assistance Recording available           |   November 5, 2019    ||               Non-binding Notice of Intent due               |   December 3, 2019    ||              NOFO question submission deadline               |   December 3, 2019    ||                     **Applications due**                     | **December 12, 2019** || Budget Committee review/approval of recommended designations |     January 2020      ||                      Program start date                      |   February 18, 2020   |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.SFY20NEWTRCNOFO@Illinois.gov by the 11:59 p.m., December 12, 2019, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/SFY20TRCApplication.docx) (docx) [TRCAPPLICATION.pdf].- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/ICJIATRCBudget.xlsx)- [Completed Program Narrative Category 1 (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/NarrativeCategory1NewTRC.DOCX)- [Completed Program Narrative Category 2 (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/NarrativeCategory2ExisitingTRC.DOCX)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/SFY20TRCZip.zip){.text-center .Zip-Docs}## QuestionsQuestions regarding this NOFO may be submitted to CJA.SFY20NEWTRCNOFO@Illinois.gov until 11:59 p.m. December 3, 2019.[Download the latest questions and answers here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-trauma-recovery/ResponsetoTRCnofoQuestions.doc).### Contact InformationJason WynkoopIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.SFY20NEWTRCNOFO@Illinois.gov","fundingType":"nofo"},{"slug":"2019-voca-ffy18-housing","legacy":true,"title":"Victims of Crime Act (VOCA) FFY18 Transitional Housing Program","summary":"ICJIA is requesting proposals for FFY18 Victims of Crime Act grants to support the development or expansion of transitional housing and related costs. A total of $5 million in funding is available through this solicitation for use over a period of 12 months. ","posted":"2019-10-15T00:00:00.000Z","expires":"2019-12-01T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-voca-ffy18-housing/NOFO.VOCA.TH.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Transitional Housing Program. Grants will be made with FFY18 Victims of Crime Act (VOCA) funds. A total of $5 million in funding in for transitional housing programs is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 pm, December 1, 2019.**## Program RequirementsICJIA has made available $5 million in VOCA grant funding for the development or expansion of transitional housing and related support costs for victims of crime. Funded programs will facilitate victims’ pursuit of safety, independence, and stable housing. Grant awards must be spent over a period of 12 months. Additional funding to extend the grant period will depend on both the availability of funds and project performance during the first 12 months. This funding opportunity will support transitional housing services for persons whose housing needs arise from or are a cause of their victimization. Persons served must be adults (and, when appropriate, their dependent children) and victims of crimes including, but not limited to, domestic violence (including intimate partner violence), human trafficking, anti-LGBTQ+ violence, and forced labor.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, **March 1, 2020** to be considered for funding.## Eligible ApplicantsEligible applicants are limited to:Public Agency and Nonprofit Organization. Operated by a public agency or nonprofit organization, or a combination of such organizations, and provides direct services to crime victims. Nonprofit organizations must submit proof of 501(c)(3) status as determined by the Internal Revenue Service.## DeadlineCompleted application materials must be emailed to CJA.VOCA.THNOFO@illinois.gov by **11:59 p.m., December 1, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a FFY18 Victims of Crime Act (VOCA) fund. A total of $5 million in funding is available through this solicitation. A minimum of $100,000 and a maximum of $500,000 will be awarded to successful applicants.### Period of PerformanceFunding is available for the period of March 1, 2020 through February 28, 2021. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 1:30 p.m. on October 17, 2019.• [NOFO Guidelines](https://youtu.be/trg8DIF3T2A)• [General Requirements](https://www.youtube.com/watch?v=PBwekeMT5dk)• [Indirect Costs](https://www.youtube.com/watch?v=4stkASoNY5w)Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., November 15, 2019**.[COMPLETE NOTICE OF INTENT](https://icjia.az1.qualtrics.com/jfe/form/SV_2bCbuhW8We85Cpn)## Timeline|                             Task                             |               Date               || :----------------------------------------------------------: | :------------------------------: ||                         NOFO Posted                          |       **October 15, 2019**       ||           Technical Assistance Recording available           |         October 17, 2019         ||                     Notice of Intent due                     |        November 15, 2019         ||              NOFO question submission deadline               |        November 20, 2019         ||                     **Applications Due**                     | **11:59 p.m., December 1, 2019** || Budget Committee review/approval of recommended designations |           January 2020           ||                 Projected program start date                 |          March 1, 2020           |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.VOCA.THNOFO@illinois.gov by the **11:59 p.m., December 1, 2019**, deadline for application review. Click the links below to download copies.- [Complete Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-voca-ffy18-housing/NOFO.Uniform.Application.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-voca-ffy18-housing/NOFO.VOCA.TH.NARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-voca-ffy18-housing/NOFO.VOCA.TH.BUDGET.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-voca-ffy18-housing/NOFO.VOCA.TH.ZIP)### QuestionsQuestions regarding this NOFO may be submitted to CJA.VOCA.THNOFO@illinois.gov until 11:59 p.m. November 20, 2019.[Download the latest questions and answers](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-voca-ffy18-housing/VOCA.TH.FAQs.docx).### Contact InformationRonnie J ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.VOCA.THNOFO@illinois.gov","fundingType":"nofo"},{"slug":"2019-forensic-science","legacy":true,"title":"FFY2019 PAUL COVERDELL FORENSIC SCIENCE IMPROVEMENT ACT/NATIONAL FORENSIC SCIENCE IMPROVEMENT ACT (NFSIA)","summary":"The Illinois Criminal Justice Information Authority (ICJIA) is requesting proposals to help improve the quality and timeliness of forensic science and medical examiner/coroner services throughout Illinois. Grants will be made with NFSIA FFY19 funds. A total of $663,555in funding is available through this solicitation from a targeted period of February 1, 2020 – December 31, 2020. Additional funding of up to 24 months may be awarded after the initial funding period, contingent upon a satisfactory performance and availability of funds. Total funding for the grant program will not exceed 36 months.","posted":"2019-10-23T00:00:00.000Z","expires":"2019-11-29T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/NFSIAFFY19NOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority (ICJIA) is requesting proposals to help improve the quality and timeliness of forensic science and medical examiner/coroner services throughout Illinois. Grants will be made with NFSIA FFY19 funds. A total of $663,555in funding is available through this solicitation from a targeted period of February 1, 2020 – December 31, 2020. Additional funding of up to 24 months may be awarded after the initial funding period, contingent upon a satisfactory performance and availability of funds. Total funding for the grant program will not exceed 36 months.**Application deadline: November 29, 2019.**## Program Requirements1.  At least fifty-seven percent of funding must be used to reduce the opioid crisis in your area.2.  Applicant must certify that they use of generally accepted laboratory practices.3.  Each forensic science laboratory must certify that it is accredited or use a portion of the grant to prepare and apply for such accreditation.4.  Each forensic science lab must have a process in place to conduct independent external investigations into allegations of serious negligence or misconduct.5.  Budget- each line item and narrative must clearly identify which items are opioid or non-opioid related.## Eligibility InformationAn entity may not apply for a grant until the entity has registered and pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, www.grants.illinois.gov/portal. Registration and pre-qualification are required each state fiscal year.Applicants are also required to submit a financial and administrative risk assessment utilizing an Internal Controls Questionnaire (ICQ) for state fiscal year 2020 Delay in obtaining SF2020 ICQ approval will result in a delay in grant execution.**_1. Eligible Applicants_**An entity may not apply for a grant until the entity has registered and pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, www.grants.illinois.gov/portal. Registration and pre-qualification are required each state fiscal year.Applicants are also required to submit a financial and administrative risk assessment utilizing an Internal Controls Questionnaire (ICQ) for state fiscal year 2020 Delay in obtaining SF2020 ICQ approval will result in a delay in grant execution._Please note:_ “Police identification units” (units operating outside of the crime laboratory function), or entities that engage exclusively in evidence collection and documentation, **are not** forensic science laboratories for these purposes## DeadlineCompleted application materials must be emailed to CJA.NFSIAFFY19@Illinois.gov by **11:59 p.m., November 29, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.### Available FundsA total of $663,555 in funding is available through this solicitation. ICJIA will award a minimum of $75,000 and a maximum of $150,000 to eligible labs. One application per agency and up to three labs per agency may be funded.Remaining funds may be made available to successful applicants on a prorated basis.Agreements that result from this funding opportunity are contingent upon and subject to the availability of funds of sufficient funds. ICJIA, may terminate or suspend this agreement, in whole or in part, without penalty or further payment being required, if (i) sufficient funds for the agreement have not been appropriated or otherwise made available to the grantor by the state or the federal funding source, (ii) the governor or grantor reserves funds, or (iii) the governor or ICJIA determines that funds will not or may not be available for payment. ICJIA will provide notice, in writing, to the grantee of any such funding failure and its election to terminate or suspend the agreement as soon as practicable. Any suspension or termination pursuant to this Section will be effective upon the date of the written notice unless otherwise indicated.Applications must include an Implementation Schedule that describes how the program activities will be carried out. The Implementation Schedule must include information that will allow ICJIA to assess grant activity relative to planned project performance.## Period of PerformanceFunding will be made available for a program period of February 1, 2020, to December 31, 2020. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 1:30 p.m. on October 29, 2019.View the required Technical Assistance Webinars below:• [NFSIA FFY19 NOFO Budget Instructions](https://www.youtube.com/watch?v=bAenkSUsMVw&feature=youtu.be)• [NFSIA FFY19 General Requirements](https://www.youtube.com/watch?v=6QY4hZFuXcY&feature=youtu.be)• [NFSIA FFY19 NOFO Program Information](https://www.youtube.com/watch?v=in7aa5_Olco&feature=youtu.be)Information provided during this webinar recording will be unofficial and not binding on the state.## Timeline|                                   Task                                   |               Date                || :----------------------------------------------------------------------: | :-------------------------------: ||                               NOFO Posted                                |       **October 29, 2019**        ||                    NOFO question submission deadline                     |         November 22, 2019         ||                           **Applications Due**                           | **11:59 p.m., November 29, 2019** || Anticipated Budget Committee review/approval of recommended designations |           January 2020            ||                       Projected program start date                       |      After February 1, 2020       |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to submit quarterly data report in accordance with the objectives and performance measures provided by the U.S Department of Justice/Office of Justice Programs/National Institute of Justice.## Required DocumentsThe following documents must be emailed to CJA.NFSIAFFY19@Illinois.gov by the **11:59 p.m., November 29, 2019,** deadline for application review. Click the links below to download copies.- [Complete Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/NFSIAFFY19Application.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/NFSIAFFY19ProgramNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/NFSIAFFY19Budget.xlsx)- [Appendix I (PDF)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/AppendixI.PDF)- Proof of Accreditation (No Link)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/NFSIAFFY19Zip.zip)## QuestionsQuestions regarding this funding opportunity may [downloaded here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-forensic-science/NFSIAFFY19NOFOQA.docx).## Contact InformationLajuana MurphyCriminal Justice Specialist IIIllinois Criminal Justice Information Authority300 W. Adams, STE 200Chicago, IL 60606CJA.NFSIAFFY19@Illinois.gov","fundingType":"nofo"},{"slug":"2019-fy18-rsat","legacy":true,"title":"FY18 Residential Substance Abuse Treatment Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants the federal Residential Substance Abuse Treatment Program (RSAT). Grants will be made with FY18 RSAT funds. A total of $700,000 in funding shall be made available to local government agencies for corrections-based or jail-based substance use disorder treatment or aftercare programs that meet the criteria detailed in the notice of funding opportunity for use over a period of 12 months.","posted":"2019-09-05T00:00:00.000Z","expires":"2019-10-31T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-fy18-rsat/RSATNOFO.docx) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants the federal Residential Substance Abuse Treatment Program (RSAT). Grants will be made with FY18 RSAT funds. A total of $700,000 in funding shall be made available to local government agencies for corrections-based or jail-based substance use disorder treatment or aftercare programs that meet the criteria detailed in the notice of funding opportunity for use over a period of 12 months.**Application deadline: October 31, 2019**## Program RequirementsThis grant will fund programs in the following categories which are defined below.1. Corrections-based substance use disorder treatment2. Jail-based substance use disorder treatment3. Aftercare services### Corrections-based substance use disorder treatmentPrograms must:- Engage participants for a period between six and 12 months.- Provide residential treatment facilities set apart from the general correctional population. This can be a completely separate facility or dedicated housing unit in a facility exclusively for RSAT participants.- Focus on the inmate’s substance use diagnosis and addiction-related needs.- Develop the inmate’s cognitive, behavioral, social, vocational, and other skills to solve the substance use and related problems.- Require urinalysis and/or other proven reliable forms of drug and alcohol testing for program participants, including both periodic and random testing, and for former participants while they remain in the custody of the state or local government.- Prepare participants for successful community reintegration, including post-release referral to appropriate evidence-based aftercare treatment and service providers that support the use of medication-assisted treatment.If possible, RSAT participation should be limited to inmates with six to 12 months remaining in their confinement so they can be released from prison instead of returning to the general prison population after completing the program.Program design must be based on effective, scientific practices.### Jail-based substance use disorder treatmentPrograms must:- Engage participants for at least three months.- Focus on the inmate’s substance use diagnosis and addiction-related needs.- Develop the inmate’s cognitive, behavioral, social, vocational, and other skills to solve the substance use and related problems with emphasis on the provision of cognitive-behavioral therapy.- Require urinalysis and/or other proven reliable forms of drug and alcohol testing for program participants, including both periodic and random testing, and for former participants while they remain in the custody of the state or local government.- Prepare participants for successful community reintegration, including post-release referral to appropriate evidence-based aftercare treatment and service providers that support the use of medication assisted treatment.- If possible, jail-based programs should separate the treatment population from the general correctional population and program design should be based on effective, scientific practices.### Aftercare ServicesSubstance use disorder treatment, established or implemented with assistance provided under RSAT, must provide aftercare services.Programs must:- Involve coordination between the correctional treatment program, post-release supervision officer, and other social service and rehabilitation programs and services.- Work in conjunction with state and local authorities and organizations involved in substance use disorder treatment to assist in the placement of program participants into community substance use disorder treatment programs or services on release.- Provide reentering individuals with comprehensive care coordination prior to and upon release from the facility. This includes a comprehensive reentry plan for aftercare services, other needs, and resources. It is most successfully accomplished when institution staff initiates linkages with aftercare agencies and services outside of the institution, including social services and/or treatment services, parole, and case management [1]. Continuity between prison and community can reduce re-offense rates [2].In addition:- To qualify as an aftercare program, the head of the substance use disorder treatment program must work in conjunction with state and local authorities and organizations involved in substance use disorder treatment to assist in the placement of program participants into community substance use disorder treatment programs or services on release.Effective correctional and aftercare programming is most effective if they are **_structured, cognitive-behavioral, and skills-based._** Approaches such as Alcoholics Anonymous or faith/spiritual-based services do not meet the standard for correctional or treatment programs [3].1. SAMHSA Treatment Improvement Protocol (TIP) 30: Continuity of Offender Treatment for Substance Use Disorders from Institution to Community. https://bit.ly/2I2OaPJ2. Serin, R. & Crime and Justice Institute. (2005). Evidence-based practices: Principles for enhancing correctional results in prisons. Washington, DC: U.S. Department of Justice, National Institute of Corrections.3. Serin, R. & Crime and Justice Institute. (2005). Evidence-based practices: Principles for enhancing correctional results in prisons. Washington, DC: U.S. Department of Justice, National Institute of Corrections.; Broome, K. M., Simpson, D. D., & Joe, G. W. (2002). The role of social support following short-term inpatient treatment. The American Journal on Addictions, 11, 57-65.; see also Chapter 4 in the 2016 Surgeon General’s Report on Alcohol, Drugs, and Health. https://bit.ly/2MBQG2N## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/ to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, April 1, 2020 to be considered for funding.## DeadlineCompleted application materials must be emailed to CJA.2019rsatNOFO@Illinois.gov by **11:59 p.m., October 31, 2019** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of FY18 RSAT funds. A minimum of $700,000 dollars will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of April 1, 2019 through March 31, 2020. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.## Timeline|                             Task                             |         Date          || :----------------------------------------------------------: | :-------------------: ||                         NOFO Posted                          | **September 5, 2019** ||              NOFO question submission deadline               |   October 24, 2019    ||                     **Applications Due**                     | **October 31, 2019**  || Budget Committee review/approval of recommended designations |     December 2019     ||                 Projected program start date                 |     April 1, 2020     |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.2019rsatNOFO@Illinois.gov by the **11:59 p.m., October 31, 2019** deadline for application review. Click the links below to download copies.- [Complete Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-fy18-rsat/RSATApplication.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-fy18-rsat/RSATNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-fy18-rsat/RSATBudget.xlsx)### <p class=\"text-center\">[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-fy18-rsat/RSATZip.zip)### QuestionsQuestions regarding this NOFO may be submitted to CJA.2019rsatNOFO@Illinois.gov until **11:59 p.m., October 24, 2019**. Questions and responses will be posted at https://grants.icjia.cloud.### Contact InformationShataun D. HaileyIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.2019rsatNOFO@Illinois.gov","fundingType":"nofo"},{"slug":"2019-violence-prevention-planning","legacy":true,"title":"Violence Prevention Planning and One Time Supports","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants Violence Prevention Planning and One Time Supports. Grants will be made with SFY 2020 Violence Prevention and Street Intervention funds. A total of $8,336,326 in funding is available through this solicitation for use over a period of 6 months. ","posted":"2019-09-30T00:00:00.000Z","expires":"2019-10-31T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/NOFOVPSIcomplete.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants Violence Prevention Planning and One Time Supports. Grants will be made with SFY 2020 Violence Prevention and Street Intervention funds. A total of $8,336,326 in funding is available through this solicitation for use over a period of 6 months.**Application deadline: 11:59 p.m. on October 31, 2019**## Program RequirementsThis Notice of Funding Opportunity offers two tracks: Track 1 is for violence prevention planning and Track 2 is for one-time supports for existing violence prevention programs. Applicants can apply to both tracks. See NOFO for more information.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, January 1, 2020 to be considered for funding.## Eligible ApplicantsEligible applicants are limited to- Municipalities- Non-profit entities.## DeadlineCompleted application materials must be emailed to CJA.StateViolencePrevention@Illinois.gov by **11:59 p.m.,** October 31, 2019, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a SFY 2020 Appropriation.## Range of Grant Award Amounts_The amounts below represent the minimum and maximum grant award amounts that applicants can request._|                     **Geographic area**                      | **Track One:** _Violence Prevention Planning_ | **Track Two**: _One-time Supports for Existing Violence Prevention Programming_ || :----------------------------------------------------------: | :-------------------------------------------: | :-----------------------------------------------------------------------------: ||                           Chicago                            |              $25,000 - $500,000               |                              $25,000 - $1,000,000                               || Suburban Cook, DuPage, Kane, Lake, McHenry and Will Counties |              $50,000 - $200,000               |                              $25,000 - $1,000,000                               ||                     Balance of the state                     |              $25,000 - $200,000               |                              $25,000 - $1,000,000                               |The geographic areas above reflect the language used to appropriate funds by geographic areas; however, applicants need not submit a proposal that provides services or benefits to the entire region.### Period of PerformanceFunding is available for the period of January 1, 2020 through June 30, 2020.## Technical Assistance SessionGeneral technical assistance recordings are currently available for viewing at these links.- [NOFO General Requirements](https://www.youtube.com/watch?v=PBwekeMT5dk)- [Indirect Costs](https://www.youtube.com/watch?v=4stkASoNY5w)A technical assistance recording is available here: [https://youtu.be/ZjSJs-iSFO0](https://youtu.be/ZjSJs-iSFO0)VIEW THE REQUIRED TECHNICAL ASSISTANCE WEBINAR RECORDING (Recording available 10.2.19)Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m.,** October 24, 2019.[Complete NOTICE of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_d7jZxiISYUb9wkl)## Timeline|                             Task                             |               Date               || :----------------------------------------------------------: | :------------------------------: ||                         NOFO Posted                          |        September 30, 2019        ||                 Applicant webinar available                  |         October 2, 2019          ||              NOFO question submission deadline               |         October 24, 2019         ||                     Notice of Intent Due                     |         October 24, 2019         ||                     **Applications due**                     | **11:59 p.m., October 31, 2019** || Budget Committee review/approval of recommended designations |          December 2019           ||                 Projected program start date                 |         January 1, 2020          |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.StateViolencePrevention@Illinois.gov by the 11:59 p.m., October 31,2019 deadline for application review. Click the links below to download copies.**TRACK ONE**- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/FY20VPSIApplication.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/VPSITRACKONENARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/FY20VPSIBudget.xlsx)**TRACK TWO**- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/FY20VPSIApplication.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/VPSITRACKTWONARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/FY20VPSIBudget.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/FY20VPSIZip.zip)## QuestionsQuestions regarding this NOFO may be submitted to CJA.StateViolencePrevention@Illinois.gov until 11:59 p.m. October 24, 2019.Click to [download questions and responses](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-violence-prevention-planning/UpdatesandResponsetoApplicantQuestionsVPSI.pdf).### Contact InformationReshma DesaiIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.StateViolencePrevention@Illinois.gov","fundingType":"nofo"},{"slug":"2019-safe-from-start-evaluation-fy20","legacy":true,"title":"Safe From the Start (SFS) Evaluation program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grant funding for the Safe From the Start (SFS) Evaluation program. Grants will be made with General Revenue State Fiscal Year 2020 funds. A total of $123,900 in funding is available through this solicitation for use over a period of eight months.","posted":"2019-09-25T00:00:00.000Z","expires":"2019-10-02T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-start-evaluation-fy20/SFSEFY20NOFO.PDF) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grant funding for the Safe From the Start (SFS) Evaluation program. Grants will be made with General Revenue State Fiscal Year 2020 funds. A total of $123,900 in funding is available through this solicitation for use over a period of eight months.**Application deadline: 11:59 p.m., October 2, 2019.**## Program Requirements- The evaluation team will meet at least twice a year with ICJIA and/or SFS grantees to discuss evaluation reports, evaluation protocols, data entry procedures, etc.- Provide evaluation training and technical assistance to grantees.- Submit IRB review application to grantee’s Institutional Review Board.- Convert online MSAccess data from sites into SPSS data. Merge data from all sites together for each evaluation measure (BIF, ASQ, ASQ-SE, SSQ, PSI, CBCL, Child and Caregiver Completion of Services forms). Clean and organize SPSS data. Match pre, interim, post, and follow-up data for each repeated measure (ASQ-SE, PSI, and CBCL). Examine data for out-of-range errors, outliers, and begin to analyze data for the Year End Report.- Submit aggregate Year End (covering SFY 2018) report comparing SFS data across sites and across years to ICJIA. The report must of publishable quality. The interim report should be similar to the final report in design and substance and document progress and findings to date.- Submit Individual Year End site reports to ICJIA.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date of July 1, 2019 to be considered for funding.## Eligible ApplicantsEligible applicants are limited to universities within the State of Illinois with extensive history researching state-funded childhood exposure to violence programs targeting children 0 to 5 and their families and with experience providing technical assistance to state-funded childhood exposure to violence grantees.## DeadlineCompleted application materials must be emailed to CJA.StateViolencePrevention@Illinois.gov by **11:59 p.m., October 2, 2019**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of state fiscal year 2020 funds. A minimum of $1,080,000 dollars will be made available through this funding opportunity.### Period of PerformanceFunding is available for the period of October 31, 2019 to June 30, 2020.## Timeline|                             Task                             |        Date         || :----------------------------------------------------------: | :-----------------: ||                         NOFO Posted                          | September 25, 2019  ||              NOFO question submission deadline               |   October 1, 2019   ||                     **Applications due**                     | **October 2, 2019** || Budget Committee review/approval of recommended designations |  October 17, 2019   ||                 Projected program start date                 |  October 31, 2019   |## ReportingRecipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.StateViolencePrevention@Illinois.gov by the **11:59 p.m., October 2, 2019**, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-start-evaluation-fy20/SFSEVALAPPLICATION.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-start-evaluation-fy20/SFSEVALNARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-start-evaluation-fy20/SFSEVAL.BUDGET.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-start-evaluation-fy20/SFSEVAL.zip)## QuestionsQuestions regarding this NOFO may be submitted to CJA.StateViolencePrevention@Illinois.gov **11:59 p.m., October 1, 2019**. Questions and responses will be posted at [click here.](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-start-evaluation-fy20/SFSFY20RESPONSEtoAPPLICANTQuestions)### Contact InformationMary RatliffIllinois Criminal Justice Information Authority607 West Adams, Suite 906Springfield, IL 62701CJA.StateViolencePrevention@Illinois.gov","fundingType":"nofo"},{"slug":"2019-safe-from-the-start","legacy":true,"title":"Safe From the Start (SFS) Evaluation","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grant funding for the Safe From the Start (SFS) Evaluation program. Grants will be made with General Revenue State Fiscal Year 2020 funds. A total of $123,900 in funding is available through this solicitation for use over a period of eight months. ","posted":"2019-08-19T00:00:00.000Z","expires":"2019-09-19T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-the-start/SFSEFY20NOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grant funding for the Safe From the Start (SFS) Evaluation program. Grants will be made with General Revenue State Fiscal Year 2020 funds. A total of $123,900 in funding is available through this solicitation for use over a period of eight months.**Application deadline: 11:59 p.m., September 19, 2019.**## Program Requirements- The evaluation team will meet at least twice a year with ICJIA and/or SFS grantees to discuss evaluation reports, evaluation protocols, data entry procedures, etc.- Provide evaluation training and technical assistance to grantees.- Submit IRB review application to grantee’s Institutional Review Board.- Convert online MSAccess data from sites into SPSS data. Merge data from all sites together for each evaluation measure (BIF, ASQ, ASQ-SE, SSQ, PSI, CBCL, Child and Caregiver Completion of Services forms). Clean and organize SPSS data. Match pre, interim, post, and follow-up data for each repeated measure (ASQ-SE, PSI, and CBCL). Examine data for out-of-range errors, outliers, and begin to analyze data for the Year End Report.- Submit aggregate Year End (covering SFY 2018) report comparing SFS data across sites and across years to ICJIA. The report must of publishable quality. The interim report should be similar to the final report in design and substance and document progress and findings to date.- Submit Individual Year End site reports to ICJIA.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, October 31, 2019 to be considered for funding.## Eligible ApplicantsEligible applicants are limited to universities within the State of Illinois with extensive history researching state-funded childhood exposure to violence programs targeting children 0 to 5 and their families and with experience providing technical assistance to state-funded childhood exposure to violence grantees.## DeadlineCompleted application materials must be emailed to CJA.StateViolencePrevention@Illinois.gov by **11:59 p.m., September 19, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of state fiscal year 2020 funds. A maximum of $123,900 dollars will be made available through this funding opportunity.### Period of PerformanceFunding is available for the period of October 31, 2019 to June 30, 2020.## Timeline|                             Task                             |          Date          || :----------------------------------------------------------: | :--------------------: ||                         NOFO Posted                          |    August 19, 2019     ||              NOFO question submission deadline               |   September 12, 2019   ||                     **Applications due**                     | **September 19, 2019** || Budget Committee review/approval of recommended designations |    October 17, 2019    ||                 Projected program start date                 |    October 31, 2019    |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.StateViolencePrevention@Illinois.gov by the **11:59 p.m., September 19, 2019**, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-the-start/SFSEVALAPPLICATION.docx)- [Completed Program Narrative (PDF)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-the-start/SFSEVALNARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-the-start/SFSEVAL.BUDGET.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to CJA.StateViolencePrevention@Illinois.gov **11:59 p.m. September 12, 2019**. Questions and responses will be posted at [click here.](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-the-start/SFSEVALFY20RESPONSEtoAPPLICANTQuestions.doc)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-safe-from-the-start/SFSEVALFY20ZIP.zip)### Contact InformationMary RatliffIllinois Criminal Justice Information Authority607 West Adams, Suite 906Springfield, IL 62701CJA.StateViolencePrevention@Illinois.gov","fundingType":"nofo"},{"slug":"2019-ilheals","legacy":true,"title":"Illinois Helping Everyone Access Linked Systems(HEALS)","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for support cross-system projects that improve the identification and coordination of care for children, youth, and families impacted by violence. Grants will be made with VICTIMS OF CRIME ACT FFY 17 funds. A total of $2,700,000 in funding is available through this solicitation for use over a period of 9 months. Cross-system projects applicants can apply for funding ranging from $150,000 to $500,000.","posted":"2019-08-13T00:00:00.000Z","expires":"2019-09-16T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ilheals/IllinoisHEALSNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for support cross-system projects that improve the identification and coordination of care for children, youth, and families impacted by violence. Grants will be made with VICTIMS OF CRIME ACT FFY 17 funds. A total of $2,700,000 in funding is available through this solicitation for use over a period of 9 months. Cross-system projects applicants can apply for funding ranging from $150,000 to $500,000.**Application deadline: September 16, 2019.**In 2017, the Illinois Criminal Justice Information Authority was awarded a Linking Systems of Care for Children and Youth Demonstration grant from the Office for Victims of Crime (OVC), Office of Justice Programs, U.S. Department of Justice[1].The overarching vision for Illinois HEALS (Helping Everyone Access Linked Systems) is to alleviate the burden of finding services to address victimization by ensuring appropriate care and services are made available to all victims regardless of the door they first enter, whether it is a doctor’s office, school, or local police station or sheriff’s office.Applicants should review the Illinois HEALS Action Plan (https://ilheals.com/news-publications) and propose a cross-system project that incorporates the Recognize, Connect, and Engage framework. In addition, applicants should review the application structure explanation to determine the best structure for the proposed project.1. Illinois is one of four states designated as a demonstration site.## Program Requirements- Strive to integrate the Illinois HEALS Mission, Values, and Principles as outlined in the purpose area of this solicitation.- Implement the approved program plan.- Hire and supervise the staff positions outlined in the program narrative which at minimum must include a Project Coordinator with an FTE proportionate to the size of the project.- Travel Costs to attend a minimum of 2 cross-site visits. Since location is not known, applicants should budget for a location that is at least 4 hours away.- Complete quarterly reporting requirements.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, **January 1, 2020** to be considered for funding._Be a Public Agency or Nonprofit Organization._ Applicant must represent a public entity or nonprofit organization, or a combination of such organizations, and provides direct services to crime victims. Nonprofit organizations must submit proof of 501(c)(3) status as determined by the Internal Revenue Service._Show a Record of Effective Services._ Applicants must demonstrate a record of providing effective direct services to crime victims and financial support from sources other than the Crime Victims Fund. This includes having the support and approval of its services by the community and a history of providing direct services in a cost-effective manner. New programs that have not yet demonstrated a record of providing services may be eligible for VOCA funds if they can demonstrate that a minimum of 25 percent of their financial support comes from sources other than the Crime Victims Fund in the year of, or the year preceding, the award._Meet Program Match Requirements._ Matching contributions of 20 percent (cash or in-kind) of the total costs of the VOCA project are required. Match must be committed for each VOCA-funded project and derived from sources other than federal funds._Incorporate volunteers._ Applicants must utilize volunteers unless ICJIA determines there is a compelling reason to waive this requirement._Promote Community Efforts to Aid Crime Victims._ Applicants must promote, within the community, coordinated public and private efforts to aid crime victims._Help Crime Victims Apply for Compensation._ Applicants must assist victims by identifying and notifying crime victims of the availability of compensation, referring victims to organizations that can assist them in applying, assisting victims with application forms and procedures, obtaining necessary documentation, monitoring claim status and intervening on behalf of victims with the compensation program._Comply with Federal Rules Regulating Grants._ Applicants must comply with the applicable provisions of VOCA, the VOCA Victim Assistance Program Final Rule, Office of Victims of Crime guidelines, and the requirements of the U.S. Department of Justice Grants Financial Guide and government-wide grant rules, which include maintaining appropriate programmatic and financial records that fully disclose the amount and disposition of VOCA funds received._Preserve Civil Rights._ No person shall, on the grounds of race, color, religion, national origin, sex, age, or disability, be excluded from participation in, be denied the benefits of, be subjected to discrimination under, or denied employment in connection with any VOCA-funded program or activity._Comply with State Criteria._ Applicants must abide by any additional eligibility or service criteria as established by ICJIA including submitting statistical and programmatic information on the use and impact of VOCA funds, as requested by ICJIA._Provide Services to Victims of Federal Crime._ Applicants must provide services to victims of federal crimes on the same basis as victims of state/local crimes._Maintain independence from criminal case._ Applicants may not discriminate against victims because they disagree with the way the state is prosecuting the criminal case._Provide Services Free of Charge to Victims for VOCA-Funded Services._ Applicants must provide services to crime victims at no charge through the VOCA-funded program._Protect confidentiality of Information._ Applicants must reasonably protect the confidentiality and privacy of persons receiving services under the VOCA-funded program to the extent permitted by law, as set forth in 28 CFR 94.115.## DeadlineCompleted application materials must be emailed to CJA.IllinoisHEALS@illinois.gov by **11:59 p.m., September 16, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a FFY 17 VICTIMS OF CRIME ACT. A minimum of $2,700,000 dollars will be made available through this funding opportunity with cross-system projects ranging from $150,000 to $500,000.## Period of PerformanceFunding is available for the period of **January 1, 2020 to September 30, 2020.** Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 27 months.## Technical Assistance SessionApplicants are advised to view the following mandatory technical assistance recordings prior to application submission. The recordings will be available for viewing beginning at **11:00 a.m. on August 16, 2019**. They are located on the [ICJIA YouTube channel](https://www.youtube.com/channel/UCtZMzk8D3P4OixYTwsfPeKA) and can be found through the search function.[NOFO General Requirements](https://www.youtube.com/watch?v=PBwekeMT5dk)[NOFO programmatic requirements Illinois HEALS Training](https://www.youtube.com/watch?v=pDDrG8_B6jc)[GATA compliance](https://www.youtube.com/watch?v=g18hgiS3RYI)[Indirect costs](https://www.youtube.com/watch?v=4stkASoNY5w)[VOCA Match](https://www.youtube.com/watch?v=wqIrwI5U0eY)## Notice of IntentAgencies interested in applying are strongly encouraged to complete an online Notice of Intent form by **11:59 p.m. on September 9, 2019**. Submission of a Notice of Intent is nonbinding and will be used for internal planning purposes only. Upon receipt of a Notice of Intent, ICJIA will offer technical assistance to agencies which have not yet demonstrated GATA compliance. Failure to submit a Notice of Intent by the deadline above may result in an agency not receiving technical assistance with respect to GATA compliance, therefore risking grant ineligibility. The online Notice of Intent is available at: https://icjia.az1.qualtrics.com/jfe/form/SV_006D1qjycWgYHOJ.## Timeline|                             Task                             |          Date          || :----------------------------------------------------------: | :--------------------: ||                         NOFO Posted                          |  **August 15, 2019**   ||                  Notice of Intent Deadline                   |   September 9, 2019    ||                  Last Day to Ask Questions                   |   September 9, 2019    ||                     **Applications Due**                     | **September 16, 2019** || Budget Committee review/approval of recommended designations |     December 2019      ||                 Projected program start date                 |    January 1, 2020     |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.IllinoisHEALS@illinois.gov by the **11:59 p.m., September 16, 2019**, deadline for application review. Click the links below to download copies.- [Complete Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ilheals/IllinoisHEALSAPPLICATION.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ilheals/IllinoisHEALSNARRATIVEFINAL.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ilheals/IllinoisHEALSBUDGET.xlsx)- Completed Letters of Commitment in one PDF.### <p class=\"text-center\">[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ilheals/NOFOIllinoisHEALS.zip)## QuestionsQuestions regarding this NOFO may be submitted to CJA.IllinoisHEALS@illinois.gov.[Responses to applicant questions](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ilheals/ResponsetoIllinoisHEALSNOFOApplicantQuestions.doc)## Contact InformationJason WynkoopIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.IllinoisHEALS@illinois.gov","fundingType":"nofo"},{"slug":"2019-infonet","legacy":true,"title":"Statewide InfoNet Services Program","summary":"The Illinois Criminal Justice Information Authority seeks to fund a Statewide InfoNet program.  The grant will be made with Federal Fiscal Year 2017 (FFY17) Victim of Crime Act (VOCA) funds. A total of $556,024 in funding is available through this solicitation for use over a period of 12 months. ","posted":"2019-07-19T00:00:00.000Z","expires":"2019-08-25T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-infonet/VOCAStatewideInfoNetNOFO.docx) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority seeks to fund a Statewide InfoNet program. The grant will be made with Federal Fiscal Year 2017 (FFY17) Victim of Crime Act (VOCA) funds. A total of $556,024 in funding is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 p.m., August 25, 2019.**## Program RequirementsThe Statewide InfoNet program is a web-based, centralized statewide case management system for domestic and sexual violence centers and is used by over 100 service providers throughout the state. This system is overseen and operated by ICJIA, while its use and requirements are collaboratively governed with the Illinois Coalition Against Domestic Violence (ICADV), the Illinois Coalition Against Sexual Assault (ICASA), Children’s Advocacy Centers of Illinois (CACI) and the Illinois Department of Human Services (DHS). The system allows service providers to track individual victims served and services provided, and easily produce standardized program and funding reports.The funded program will be required to submit quarterly progress reports.## Eligibility InformationThe applicant must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, www.grants.illinois.gov, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the date of application to be considered for funding. Applications from agencies that have not received ICQ approval will not be reviewed.## Eligible ApplicantsThis solicitation is open to the Illinois Criminal Justice Information Authority.## DeadlineCompleted application materials must be emailed to CJA.VOCANOFO@Illinois.gov by **11:59 p.m., August 25, 2019**, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $556,024 in funding is available through this solicitation.### Period of PerformanceFunding is available for the period of **October 1, 2019 through September 30, 2020**. Based on program performance and fund availability, the Authority may recommend allocation of funding to support an additional 24 months.### Contact InformationRonnie ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606Ronnie.Reichgelt@Illinois.gov## Timeline|                             Task                             |              Date               || :----------------------------------------------------------: | :-----------------------------: ||                         NOFO Posted                          |        **July 22, 2019**        ||                     **Applications due**                     | **11:59 p.m., August 25, 2019** || Budget Committee review/approval of recommended designations |           August 2019           ||                      Program start date                      |         October 1, 2019         |## ReportingThe recipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.","fundingType":"nofo"},{"slug":"2019-street-intervention","legacy":true,"title":"Violence Prevention and Street Intervention","summary":"The Illinois Criminal Justice Information Authority is requesting a proposal from Metropolitan Family Services for a grant to fund Violence Prevention and Street Intervention. The grant will be made with SFS state fiscal year 2020 funds. A total of $2,250,000 in funding is available through this solicitation for use over a period of ten months.","posted":"2019-07-08T00:00:00.000Z","expires":"2019-08-06T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-street-intervention/FY20StreetInterventionNOFO.docx) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting a proposal from Metropolitan Family Services for a grant to fund Violence Prevention and Street Intervention. The grant will be made with SFS state fiscal year 2020 funds. A total of $2,250,000 in funding is available through this solicitation for use over a period of ten months.**Application deadline: 11:59 p.m., Tuesday, August 6, 2019.**## Program RequirementsProgram requirements include:- Convene, expand or join an existing community coalition to engage service providers, governmental agencies (local and/or statewide agencies), law enforcement, faith-based, and general community members. The purpose of the coalition is to ensure that service providers and all potential participants are aware of violence prevention resources available in community; develop collaborative partnerships to ensure that clients’ immediate needs are met; and provide pro-social activities for the community.- The coalition should organize at least one community event during the grant period.- Educate public about program services through wide distribution and various types of program materials, public presentations and awareness events.- Implementation of Street Intervention/Interruption-Active Outreach and Engagement – Programs target at-risk youth and young adults to provide crisis intervention and de-escalation of high stress situations._**Evidence-Based Programs or Practices**_The applicant is strongly urged to incorporate research-based best practices into the program design, when appropriate. Applicant should identify the evidence-based practice being proposed for implementation, identify and discuss the evidence that shows that the practice is effective, discuss the population(s) for which this practice has been shown to be effective, and show that it is appropriate for the proposed target population.## Eligibility InformationThe applicant must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicant must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date of September 1, 2019 to be considered for funding.## Eligible ApplicantsThis solicitation is open only to not-for-profit organizations that currently utilize State of Illinois violence prevention funds to do all of the following:1. Set program requirements;2. Monitor the compliance of sub-recipients; and3. Implement the coordination of a multi-pronged evidence-based street intervention program.Each sub-recipient that is included in the eligible applicant’s application:- outreach services that utilize staff, at least one of whom has received, or is currently receiving, training through a curriculum designed to develop outreach and leadership skills- conflict intervention and mediation- support services, including, at a minimum, employment, continued education, social service, mental health/substance abuse supports.## DeadlineCompleted application materials must be emailed to CJA.StateViolencePrevention@Illinois.gov by **11:59 p.m., Tuesday, August 6, 2019** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $2,250,000 in funding is available through this solicitation.### Period of PerformanceFunding is available for the period of September 1, 2019, to June 30, 2020.## Timeline|                                   Task                                   |        Date        || :----------------------------------------------------------------------: | :----------------: ||                               NOFO Posted                                |    July 8, 2019    ||                    NOFO Question Submission Deadline                     |   July 31, 2019    ||                           **Applications due**                           | **August 6, 2019** || Anticipated Budget Committee review/approval of recommended designations |  August 15. 2019   ||                      Anticipated Program start date                      | September 1, 2019  |## ReportingRecipient must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.StateViolencePrevention@Illinois.gov by the **11:59 p.m., Tuesday, August 6, 2019** deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-street-intervention/FY20StreetInterventionUniformApplication.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-street-intervention/FY20StreetInterventionProgramNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-street-intervention/FY20StreetInterventionBudget.xlsx)- [Appendix I Trauma and Trauma-Informed Care (PDF)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-street-intervention/APPENDIXITraumaInformedServices.pdf)## QuestionsQuestions regarding this NOFO may be submitted to Shai.Hoffman@Illinois.gov until **11:59 p.m., 11:59 p.m. July 31, 2019**. Questions and responses will be posted at [click here.](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-street-intervention/FY20StreetInterventionApplicantQuestions.doc)## Applicant Technical Assistance Videos- [VIEW TECHNICAL ASSISTANCE VIDEO: Administrative Introduction](https://www.youtube.com/watch?v=atXC0whZQPM)- [VIEW TECHNICAL ASSISTANCE VIDEO: General Guidelines](https://youtu.be/PBwekeMT5dk)- [VIEW TECHNICAL ASSISTANCE VIDEO: Budget](https://www.youtube.com/embed/sQYCekU2pIw)- [VIEW TECHNICAL ASSISTANCE VIDEO: Indirect Costs](https://www.youtube.com/embed/mjp5PZx0oaY)- [VIEW TECHNICAL ASSISTANCE VIDEO: Prior Approval Requirements](https://www.youtube.com/embed/Q8UaLYqslJs)### Contact InformationShai HoffmanIllinois Criminal Justice Information Authority300 W. Adams, Suite 200Chicago, IL 60606Shai.Hoffman@Illinois.gov","fundingType":"nofo"},{"slug":"2019-illinois-heals","legacy":true,"title":"Victims of Crime Act: Illinois Helping Everyone Access Linked Systems(HEALS) Demonstration Site","summary":"The Illinois Criminal Justice Information Authority is requesting a proposal for one Illinois HEALS Demonstration site grant. Grants will be made with VICTIMS OF CRIME ACT FFY 17 funds. A total of $ 800,000 in funding is available through this solicitation for use over a period of 12 months. ","posted":"2019-06-03T00:00:00.000Z","expires":"2019-07-08T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-illinois-heals/IllinoisHEALSDemoNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting a proposal for one Illinois HEALS Demonstration site grant. Grants will be made with VICTIMS OF CRIME ACT FFY 17 funds. A total of $ 800,000 in funding is available through this solicitation for use over a period of 12 months.**Application deadline: July 8,2019.**In 2017, the Illinois Criminal Justice Information Authority was awarded a Linking Systems of Care for Children and Youth Demonstration grant from the Office for Victims of Crime (OVC), Office of Justice Programs, U.S. Department of Justice [1]. The demonstration project seeks to address the needs of child and youth victims [2] and their families [3] by identifying young crime victims, coordinating prevention and intervention services post-victimization, and building capacity within communities to provide needed services and support.The overarching vision for Illinois HEALS (Helping Everyone Access Linked Systems) is to alleviate the burden of finding services to address victimization by ensuring appropriate care and services are made available to all victims regardless of the door they first enter, whether it is a doctor’s office, school, or local police station or sheriff’s office.1. Illinois is one of four states designated as a demonstration site.2. We acknowledge that the term victim does not resonate with everyone who has experienced violence. Some prefer the term survivor or person impacted by violence. We encourage people and communities to use terms that best reflect their experiences.   Throughout this document we use the terms children and youth and young persons to refer to individuals from birth to 25 years of age.3. For reading ease, throughout this document we use the term family or family members to refer to the adults and other individuals who may live with and/or provide primary care for children and youth. These individuals or adults may include biological relatives (e.g., siblings, adults/uncles, grandparents, parents) and other caregivers (e.g., foster families, other non-relative adults).## Program Requirements- Strive to integrate the Illinois HEALS Mission, Values and Principles as outlined in this solicitation.- Implement the project goals as described in this solicitation and in the program narrative.- Hire and supervise the staff positions outlined in the program narrative.- Meet regularly with ICJIA Illinois HEALS staff to discuss implementation. These meetings will be both in person and via conference calls with a frequency collaboratively agreed upon between the coordinating Entity and Illinois HEALS staff.- Collaborate to share demonstration site progress for state and national audiences.- Develop evaluation plan in collaboration with ICJIA Research and Analysis Unit and participate in evaluation activities.- Complete quarterly reporting requirements.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date, September 1, 2019 to be considered for funding.The purpose of this pilot project is to test and document implementation of the Illinois HEALS Action Plan. The eligible applicant’s capacity is of the utmost importance. The Illinois HEALS team completed a methodical process to identify the eligible applicant from a pool of potential organizations. The eligible applicant was assessed on several criteria, including, but not limited to, ability to convene and maintain engagement of a broad array of community stakeholders, practitioners, and survivors, experience implementing a large community-wide planning processes, and experience managing grant funds. Based on this, the following eligible applicant was selected: **Egyptian Public and Mental Health Department**. There are additional eligibility criteria outlined in the NOFO.## DeadlineCompleted application materials must be emailed to CJA.IllinoisHEALSDemo@illinois.gov by **11:59 p.m., July 8, 2019** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of a FFY 17 VICTIMS OF CRIME ACT. A minimum of $ dollars will be made available through this funding opportunity.### Period of PerformanceFunding is available for the period of September 1, 2019 through August 31, 2020. Based on program performance and fund availability, the ICJIA may recommend allocation of funding to support an additional 24 months.## Timeline|                             Task                             |       Date        || :----------------------------------------------------------: | :---------------: ||                         NOFO Posted                          | **June 6, 2019**  ||                     **Applications due**                     | **July 8, 2019**  || Budget Committee review/approval of recommended designations |   August, 2019    ||                 Projected program start date                 | September 1, 2019 |## ReportingRecipients must submit periodic financial reports, periodic performance reports, final financial and performance reports, and, a calendar year end financial report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Department of Justice Bureau of Justice Assistance portal at https://bjapmt.ojp.gov.## Required DocumentsThe following documents must be emailed to CJA.DPAservicesNOFO@Illinois.gov by the **11:59 p.m., February 12, 2019**, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-illinois-heals/IllinoisHEALSDemoAPPLICATION.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-illinois-heals/IllinoisHEALSDemoNARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-illinois-heals/IllinoisHEALSDemoBUDGET.xlsx)- [Complete Logic Model (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-illinois-heals/IllinoisHEALSDemoLOGICMODEL.docx)- Completed Letters of Support in one PDF## QuestionsQuestions regarding this NOFO may be submitted to CJA.IllinoisHEALSDemo@illinois.gov.### Contact InformationReshma DesaiIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.IllinoisHEALSDemo@illinois.gov","fundingType":"nofo"},{"slug":"2019-vocadv-hotline","legacy":true,"title":"Statewide Domestic Violence Hotline Services Program","summary":"The Illinois Criminal Justice Information Authority is requesting applications for grants for the Services for Underserved Areas and Victim Groups Program. Grants will be made with FFY18 Violence Against Women Act funds. A total of $1.4 million is available through this solicitation for use over a period of 12 months. ","posted":"2019-05-28T00:00:00.000Z","expires":"2019-07-01T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vocadv-hotline/VOCADVHotlineNOFO.docx) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority seeks to fund a Statewide Domestic Violence Hotline Service program. The grant will be made with Federal Fiscal Year 2017 (FFY17) Victim of Crime Act (VOCA) funds. A total of $455,000 in funding is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 p.m., July 01, 2019.**## Program RequirementsThe Statewide Domestic Violence Hotline Services program will fund advocates positions(s) to provide direct service to victims through a statewide hotline. The City of Chicago Department of Family and Support Services may contract with an external victim service provider to staff hotline services, but is required to submit at the time of application a proposed contract between the agency and the victim service provider detailing advocate services and costs.The funded programs will be required to submit quarterly progress reports.## Eligibility InformationApplicants are strongly urged to incorporate research-based best practices into their program design, when appropriate. Applicants should identify the evidence-based practice being proposed for implementation, identify and discuss the evidence that shows that the practice is effective, discuss the population(s) for which this practice has been shown to be effective, and show that it is appropriate for the proposed target population.## Eligible ApplicantsThis solicitation is open to the City of Chicago Department of Family and Support Services.## DeadlineCompleted application materials must be emailed to CJA.VOCANOFO@Illinois.gov by **11:59 p.m., July 01, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $455,000 in funding is available through this solicitation.### Period of PerformanceFunding is available for the period of **September 1, 2019 through August 31, 2020.** Based on program performance and fund availability, the Authority may recommend allocation of funding to support an additional 24 months.### Contact InformationRonnie ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606Ronnie.Reichgelt@Illinois.gov## Timeline|                             Task                             |             Date              || :----------------------------------------------------------: | :---------------------------: ||                         NOFO Posted                          |       **May 24, 2019**        ||                     **Applications due**                     | **11:59 p.m., July 01, 2019** || Budget Committee review/approval of recommended designations |          August 2019          ||                 Projected program start date                 |       September 1, 2019       |## ReportingThe recipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.VOCANOFO@Illinois.gov by the **11:59 p.m., July 01, 2019,** to be considered for funding. Proposals will not be adeadline for application review. Click the links below to download copies.- [Complete Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vocadv-hotline/VOCAHotlineUniformApplicationforGrantAssistance.docx)- [Attachment 1 Trauma Informed Services (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vocadv-hotline/ATTACHMENT1TraumaInformedServices.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vocadv-hotline/VOCAStatewideDomesticViolenceHotlineProposalNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vocadv-hotline/VOCAStatewideDVHotlineUniformBudget.xlsx)","fundingType":"nofo"},{"slug":"2019-sfsfy20","legacy":true,"title":"Safe From the Start SFY20","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants funding Safe From the Start site (SFS). Grants will be made with SFS state fiscal year 2020 funds. A total of $1,080,000 in funding is available through this solicitation for use over a period of 12 months. ","posted":"2019-04-11T00:00:00.000Z","expires":"2019-05-12T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-sfsfy20/SFSFY20NOFO.PDF) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants funding Safe From the Start site (SFS). Grants will be made with SFS state fiscal year 2020 funds. A total of $907,500 in funding is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 p.m., May 13, 2019.**## Program RequirementsIFVCC requirements include:- Follow the SFS program model as described in the Program Design section,- Comply with the evaluation protocol,- Attend SFS coordinator’s meeting (to be held in the 2nd Quarter) in Central Illinois,- Submit all quarterly and year end reports._**Evidence-Based Programs or Practices**_ Applicants are strongly urged to incorporate research-based best practices into their program design, when appropriate. Applicants should identify the evidence-based practice being proposed for implementation, identify and discuss the evidence that shows that the practice is effective, discuss the population(s) for which this practice has been shown to be effective, and show that it is appropriate for the proposed target population.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date of July 1, 2019 to be considered for funding.## Eligible ApplicantsEligible applicants include FY 19 Safe From the Start funded programs. See sites and geographic areas below.|                     Implementing Agency                     | Maximum Funding Amount |                                                                             Geographic Area                                                                             || :---------------------------------------------------------: | :--------------------: | :---------------------------------------------------------------------------------------------------------------------------------------------------------------------: || Children's Advocacy Center of North & Northwest Cook County |        $121,500        |                    Cook/Kane (Elk Grove, Hanover, Maine, Palatine, Schaumburg, and Wheeling Townships; Prospect Heights; Carpentersville; E. Dundee)                    ||               Center for Prevention of Abuse                |        $121,500        |                                                                      Peoria, Tazewell and Woodford                                                                      ||                        Casa Central                         |        $75,000         |                            Chicago (Austin, Belmont Cragin, Hermosa, Humboldt Park, Logan Square, Near West Side, South Lawndale, West Town)                            ||                     Child Abuse Council                     |        $121,500        |                                                                      Rock Island, Henry and Mercer                                                                      ||          Children's Home + Aid Society of Illinois          |        $121,500        |                                                                                 McLean                                                                                  ||                     Family Focus, Inc.                      |        $75,000         |                                                                    Cook (Englewood and W Englewood)                                                                     ||                Heartland Human Care Services                |        $75,000         |                                             Cook (Pilsen, Little Village, Brighton Park, Back of the Yards, McKinley Park)                                              ||                Metropolitan Family Services                 |        $75,000         |                                                                 Cook (Roseland, Pullman, West Pullman)                                                                  ||             South Suburban Family Shelter, Inc.             |        $121,500        | Cook and Will (Townships include: Bloom, Bremen, Calumet, Orland, Palos, Rich, Thornton, Worth, Crete, Frankfort, Manhattan, Monee, New Lennox, Peotone and Washington) |## DeadlineCompleted application materials must be emailed to CJA.StateViolencePrevention@Illinois.gov by **11:59 p.m., May 13, 2019** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of state fiscal year 2020 funds. A minimum of $1,080,000 dollars will be made available through this funding opportunity.### Period of PerformanceFunding is available for the period of July 1, 2019, to June 30, 2020.## Timeline|                             Task                             |             Date             || :----------------------------------------------------------: | :--------------------------: ||                         NOFO Posted                          |        April 11, 2019        ||              NOFO question submission deadline               |         May 6, 2019          ||                     **Applications due**                     | **11:59 p.m., May 13, 2019** || Budget Committee review/approval of recommended designations |        June 20, 2019         ||                 Projected program start date                 |         July 1, 2019         |## ReportingRecipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.StateViolencePrevention@Illinois.gov by the **11:59 p.m., May 13, 2019**, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-sfsfy20/SFSFY20Application.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-sfsfy20/SFSFY20ProgramNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-sfsfy20/SFSFY20BudgetTemplate.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to CJA.StateViolencePrevention@Illinois.gov **11:59 p.m., May 6, 2019**. Questions and responses will be posted at [click here.](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-sfsfy20/SFSFY20RESPONSEtoAPPLICANTQuestions.pdf)### Contact Information> <strong>Shai Hoffman</strong></br>> Illinois Criminal Justice Information Authority<br/>> 300 West Adams, Suite 200<br/>> Chicago, IL 60606<br/>> CJA.StateViolencePrevention@Illinois.gov</p>","fundingType":"nofo"},{"slug":"2019-vawa","legacy":true,"title":"Violence Against Women Act (VAWA)  Services for Underserved Areas & Victim Groups","summary":"The Illinois Criminal Justice Information Authority is requesting applications for grants for the Services for Underserved Areas and Victim Groups Program. Grants will be made with FFY18 Violence Against Women Act funds. A total of $1.4 million is available through this solicitation for use over a period of 12 months. ","posted":"2019-03-29T00:00:00.000Z","expires":"2019-04-30T00:00:00.000Z","body":"[Link to NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vawa/VAWANOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting applications for grants for the Services for Underserved Areas and Victim Groups Program. Grants will be made with FFY18 Violence Against Women Act funds. A total of $1.4 million is available through this solicitation for use over a period of 12 months.## Application deadlineApplication materials must be received by **11:59 p.m. on Tuesday, April 30, 2019**.## Program RequirementsAs part of the recommendations established by the Victim Services Ad Hoc Committee, enhancing victim safety and providing access to services for underserved communities is a priority. To fulfill this priority, ICJIA has made available VAWA grant funding for victims of domestic violence and sexual assault in underserved communities and victim groups.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the date of period of performance start date, July 1, 2019 to be considered for funding.## Eligible ApplicantsThis solicitation is open not for profit corporations that administer state-wide community-based domestic violence programs, which provide advocacy, technical assistance, training, public information about domestic violence issues, in-person counseling, information and referral, community education, professional training, institutional advocacy and provide services to victims of domestic violence in underserved communities.It is also open for not for profit corporations that administer state-wide sexual assault crisis centers, which provide comprehensive sexual assault services: 24-hour hotline, 24-hour criminal justice and medical advocacy services, in-person counseling, information and referral, community education, professional training, institutional advocacy, and provide services to victims in underserved communities or victim groups. In addition, applicants must administer state and federal funds to its members, set standards for services and monitor each center to ensure program and fiscal accountability.## DeadlineCompleted application materials must be emailed to 2019VAWANOFO@Illinois.gov by **11:59 p.m., Tuesday, April 30, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of FFY18 Violence Against Women Act funds. A minimum of $14.1 million will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of July 1, 2019, through June 30, 2020.## Technical Assistance SessionN/A## Timeline|                             Task                             |        Date        || :----------------------------------------------------------: | :----------------: ||                         NOFO posted                          |   April 1, 2019    ||           Technical Assistance Recording available           |        N/A         ||                     Notice of Intent due                     |        N/A         ||              NOFO question submission deadline               |   April 15, 2019   ||                     **Applications due**                     | **April 30, 2019** || Budget Committee review/approval of recommended designations |     June 2019      ||                      Program start date                      |    July 1, 2019    |## ReportingRecipients must submit monthly/quarterly financial reports, monthly/quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Office of Victims of Crime portal at https://OVCPMT.usdoj.gov .## Required DocumentsThe following documents must be emailed to 2019VAWANOFO@Illinois.gov by the **11:59 p.m., Tuesday, April 30, 2019,** deadline for application review.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vawa/VAWAApplication.pdf)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vawa/VAWAProgramNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-vawa/VAWABudget.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to 2019VAWANOFO@Illinois.gov until 11:59 p.m. on April 15, 2019. Questions and responses will be posted at https://grants.icjia.cloud.## Contact InformationShataun HaileyIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 606062019VAWANOFO@Illinois.gov","fundingType":"nofo"},{"slug":"2019-ifvcc","legacy":true,"title":"Illinois Family Violence Coordinating Council","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants funding local Illinois Family Violence Coordinating Council (IFVCC). Grants will be made with IFVCC state fiscal year 2020 funds. A total of $435,000 in funding is available through this solicitation for use over a period of 12 months. ","posted":"2019-03-13T00:00:00.000Z","expires":"2019-04-05T00:00:00.000Z","body":"[Link to NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ifvcc/IFVCCNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants funding local Illinois Family Violence Coordinating Council (IFVCC). Grants will be made with IFVCC state fiscal year 2020 funds. A total of $435,000 in funding is available through this solicitation for use over a period of 12 months.**Application deadline: 11:59 p.m., April 5, 2019**## Program RequirementsIFVCC requirements include:- Coordinate efforts to improve the systems response to family violence (including but not limited to domestic violence, child abuse, teen dating violence, and abuse against older adults and persons with disabilities).  _ This is done through the coordinating and convening of committees and workgroups.  _ Councils are required to have a steering committee that meets no less than three times per year.  _ Councils are encouraged to have at least two additional sub-committees and/or workgroups that meet quarterly at a minimum.  _ Council membership should include a diverse representation from disciplines not limited to those listed in Exhibit G in the program narrative.- Improve the knowledge of criminal justice professionals on family violence related topics.  _ This is done through providing trainings to criminal justice and social service professionals and the collection of pre/post tests and evaluations. These trainings include:  _ Arrest Protocol trainings.  _ Arrest Promising Practice Mini-Toolkit trainings.  _ Non-arrest trainings that can be on topics related to family violence of interest based on the council’s specific geographic region’s needs.      \tNote: Councils are required to provide at least one of each type of the above trainings during the grant period.- Increase community awareness and knowledge of family violence issues (including but not limited to domestic violence, child abuse, teen dating violence, and abuse against older adults and persons with disabilities).  _ This is done through:  _ Community awareness events. \\* Information and resource sharing and outreach to both community members and agencies/organizations in the circuit.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the period of performance start date of July 01, 2019 to be considered for funding.## Eligible ApplicantsThis solicitation is open to public and not-for profit entities in Illinois. Advocacy agencies are not eligible to apply due to judicial ethic rules.Eligible applicants include but are not limited to:- Government agencies, including local and county government.- Educational institutions and regional offices of education.- Non- profit agencies, excluding advocacy agencies.## DeadlineCompleted application materials must be emailed to CJA.IFVCC.NOFO@Illinois.gov by **11:59 p.m., April 5, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of state fiscal year 2020 funds. A minimum of $435,000 dollars will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of July 1, 2019, to June 30, 2020. Based on program performance and fund availability, ICJIA may recommend allocation of funding to support an additional 24 months.## Technical Assistance SessionTechnical assistance recordings providing additional information regarding this funding opportunity will be available for viewing beginning at 5:00 p.m. on March 13, 2019.Recording 1: IFVCC NOFO Guidelines (Coming soon!!)[Recording 2: General Requirements (11:19)](https://www.youtube.com/embed/zPaIPFXZvmg)[Recording 3: GATA Budget (19:03)](https://www.youtube.com/embed/sQYCekU2pIw)[Recording 4: Indirect Costs (6:18)](https://www.youtube.com/embed/mjp5PZx0oaY)[Recording 5: Prior Approvals (6:05)](https://www.youtube.com/embed/Q8UaLYqslJs)Information provided during this webinar recording will be unofficial and not binding on the state.## Notice of IntentAgencies interested in applying are asked to submit an online Notice of Intent by **11:59 p.m., March 20, 2019**.[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_5vgq9ojdTws2NgN)## Timeline|                             Task                             |             Date              || :----------------------------------------------------------: | :---------------------------: ||                         NOFO posted                          |         March 6, 2019         ||           Technical Assistance Recording available           |        March 13, 2019         ||                     Notice of Intent due                     |        March 20, 2019         ||              NOFO question submission deadline               |        March 29, 2019         ||                     **Applications due**                     | **11:59 p.m., April 5, 2019** || Budget Committee review/approval of recommended designations |         June 27, 2019         ||                      Program start date                      |         July 1, 2019          |## ReportingRecipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.IFVCC.NOFO@Illinois.gov by the 11:59 p.m., April 5, 2019, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ifvcc/IFVCCApplication.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ifvcc/IFVCCNarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ifvcc/IFVCCBudget.xlsx)[DOWNLOAD ZIP FILE OF ALL REQUIRED APPLICATION DOCUMENTS](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ifvcc/NOFODocuments_IFVCC.zip)## QuestionsAll substantive questions and responses will be posted. Updates to NOFO materials, and questions from applicants and their responses are revised weekly. [View them here](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-ifvcc/IFVCCRESPONSEtoAPPLICANTQuestions.pdf).## Contact InformationLacey PollockIllinois Criminal Justice Information Authority607 East Adams, Suite 906Springfield, IL 62701CJA.IFVCC.NOFO@Illinois.gov","fundingType":"nofo"},{"slug":"2019-dpatraining","legacy":true,"title":"Death Penalty Abolition Fund: Law Enforcement Training","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants funding training of law enforcement personnel. Grants will be made with State Fiscal Year 2019 Death Penalty Abolition (DPA) funds. A total of $4.5 million in funding is available through this solicitation for use over a period of two months. Contingent on future appropriation and satisfactory performance, State Fiscal Year 2020 DPA funds also may be made available through this opportunity.","posted":"2019-01-29T00:00:00.000Z","expires":"2019-03-18T00:00:00.000Z","body":"[View the Notice of Funding Opportunity](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-dpatraining/DPAtrainingNOFO.pdf) {.text-center .nofo-link}## IntroductionThe Illinois Criminal Justice Information Authority is requesting proposals for grants funding training of law enforcement personnel. Grants will be made with State Fiscal Year 2019 Death Penalty Abolition (DPA) funds. A total of $4.5 million in funding is available through this solicitation for use over a period of two months. Contingent on future appropriation and satisfactory performance, State Fiscal Year 2020 DPA funds also may be made available through this opportunity.**Application deadline: 11:59 p.m., March 18, 2019.**## Program RequirementsThrough this funding opportunity, ICJIA is soliciting applications proposing to provide training to law enforcement personnel. Proposals must be received from the agencies that will be delivering all three of the following components of the training program:- Planning and provision of training.- Training supervision and oversight.- Assessment of training effectiveness.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, www.grants.illinois.gov, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their State Fiscal Year 2019 Internal Control Questionnaire (ICQ) by the date of period of performance start date, May 1, 2019, to be considered for funding.## Eligible ApplicantsEligible applicants must meet the following requirements:- Applicants must have experience providing training to law enforcement personnel.- Applicants must be one of these types of agencies and institutions:  o Governmental Agencies, including state and local law enforcement agencies, and the Illinois Law Enforcement Training and Standards Board.  o Educational Institutions.    o Non-profit Agencies, including the Mobile Training Units.## DeadlineCompleted application materials must be emailed to CJA.DPAtrainingNOFO@Illinois.gov by 11:59 p.m., Monday, March 18, 2019, to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsA total of $4.5 million in DPA funds are available through this NOFO. Awards totaling a minimum of $10,000 and maximum of $1 million will be made.### Period of PerformanceFunding is available for the period of May 1, 2019, to June 30, 2019. Based on program performance and future appropriation, ICJIA may recommend allocation of funding to support an additional 34 months of program activity. If appropriated, SFY20 funding will be available for the period of July 1, 2019, to June 30, 2020.### Contact InformationGreg StevensIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606Gregory.Stevens@Illinois.gov### Required Technical Assistance RecordingsThe following technical assistance recordings providing additional information regarding this funding opportunity are available for viewing.[Recording 1: DPA Training NOFO Guidelines (12:27)](https://youtu.be/Q7txdYclQi8)[Recording 2: General Requirements (11:19)](https://www.youtube.com/embed/zPaIPFXZvmg)[Recording 3: GATA Budget (19:03)](https://www.youtube.com/embed/sQYCekU2pIw)[Recording 4: Indirect Costs (6:18)](https://www.youtube.com/embed/mjp5PZx0oaY)[Recording 5: Prior Approvals (6:05)](https://www.youtube.com/embed/Q8UaLYqslJs)Information provided during this webinar recording will be unofficial and not binding on the state.## Notices of IntentAgencies interested in applying are asked to submit an online Notice of Intent by 11:59 p.m., Thursday, February 7, 2019.[Complete Notice of Intent](https://icjia.az1.qualtrics.com/jfe/form/SV_b2XTIkFxFR0807z)## Timeline:|                             Task                             |              Date              || :----------------------------------------------------------: | :----------------------------: ||                         NOFO Posted                          |      **January 30, 2019**      ||          Technical assistance recordings available           |        January 30, 2019        ||                    Notices of Intent due                     |        February 7, 2019        ||              NOFO question submission deadline               |         March 11, 2019         ||                     **Applications due**                     | **11:59 p.m., March 18, 2019** || Budget Committee review/approval of recommended designations |         April 18, 2019         ||                 Projected program start date                 |          May 1, 2019           |## ReportingRecipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.DPAtrainingNOFO@Illinois.gov by the **11:59 p.m., March 18, 2019**, deadline for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-dpatraining/DPAtrainingAPPLICATION.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-dpatraining/DPAtrainingNARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-dpatraining/SFY19DPAtraining.BUDGET.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to CJA.DPAtrainingNOFO@Illinois.gov until **11:59 p.m., March 11, 2019**.All substantive questions and responses will be posted. Updates to NOFO materials, and questions from applicants and their responses are revised weekly. [View them here.](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-dpatraining/DPAservicesRESPONSEtoAPPLICANTQuestions.pdf)Due to the competitive nature of this solicitation, applicants may not discuss this opportunity directly or indirectly with any Authority employee other than the respondent of this email address. Only written answers to questions shall be binding on the state.","fundingType":"nofo"},{"slug":"2019-caci","legacy":true,"title":"Victims of Crime Act: Children's Advocacy Centers Program","summary":"The Illinois Criminal Justice Information Authority is requesting applications for grants Services for Children’s Advocacy Centers Program. Grants will be made with FFY17 Victims of Crime Act funds. A total of $7.1 million is available through this solicitation for use over a period of 12 months. ","posted":"2019-01-15T00:00:00.000Z","expires":"2019-03-03T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-caci/CACILeadEntityNOFO.docx) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting applications for grants Services for Children’s Advocacy Centers Program. Grants will be made with FFY17 Victims of Crime Act funds. A total of $7.1 million is available through this solicitation for use over a period of 12 months.**Application deadline:** Application materials must be received by **11:59 p.m. on Sunday, March 3, 2019**.## Program RequirementsAs part of the recommendations established by the Victim Services Ad Hoc Committee, the strengthening and expansion of core services for victims of crime is a priority. To fulfill this priority, ICJIA made available $7.1 million in VOCA grant funding for core services and related support costs for minor victims of abuse. These funds will be made available to the Children’s Advocacy Centers of Illinois.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the date of period of performance start date, July 1, 2019, to be considered for funding.## Eligible ApplicantsThis solicitation is open to the Children’s Advocacy Centers of Illinois, 400 S. 9th Street, Springfield, Illinois, 62701.## DeadlineCompleted application materials must be emailed to NOFOemail@Illinois.gov by **11:59 p.m., on Sunday, March 3, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of Victims of Crime Act FFY17 funds. A minimum of $7.1 million will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of July 1, 2019, through June 30, 2020.## Technical Assistance SessionN/A## Timeline|                             Task                             |       Date        || :----------------------------------------------------------: | :---------------: ||                         NOFO posted                          | February 1, 2019  ||           Technical Assistance Recording available           |        N/A        ||                     Notice of Intent due                     |        N/A        ||              NOFO question submission deadline               | February 25, 2019 ||                     **Applications Due**                     | **March 3, 2019** || Budget Committee review/approval of recommended designations |     June 2019     ||                      Program start date                      |   July 1, 2019    |## ReportingRecipients must submit monthly/quarterly financial reports, monthly/quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Office of Victims of Crime portal at https://ovcpmt.ojp.gov/.## Required DocumentsThe following documents must be emailed to NOFOemail@Illinois.gov by the **11:59 p.m., Sunday, March 3, 2019**, deadline for application review.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-caci/CACIapplication.pdf)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-caci/CACIprogramnarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-caci/CACIbudget.xls.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to NOFOemail@Illinois.gov until **11:59 p.m., Sunday, March 3, 2019**. Questions and responses will be posted at https://grants.icjia.cloud.## Contact InformationRonnie J. ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606NOFOemail@illinois.gov","fundingType":"nofo"},{"slug":"2019-icadv","legacy":true,"title":"Victims of Crime Act: Services for Victims of Domestic Violence Program","summary":"The Illinois Criminal Justice Information Authority is requesting applications for grants for the Services for Victims of Domestic Violence Program. Grants will be made with FFY17 Victims of Crime Act funds. A total of $21.3 million is available through this solicitation for use over a period of 12 months. ","posted":"2019-01-29T00:00:00.000Z","expires":"2019-03-03T00:00:00.000Z","body":"[CLICK FOR NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icadv/ICADVLeadEntityNOFO.docx) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting applications for grants for the Services for Victims of Domestic Violence Program. Grants will be made with FFY17 Victims of Crime Act funds. A total of $21.3 million is available through this solicitation for use over a period of 12 months.## Application DeadlineApplication materials must be received by **11:59 p.m. on Sunday, March 3, 2019.**## Program RequirementsAs part of the recommendations established by the Victim Services Ad Hoc Committee, the strengthening and expansion of core services for victims of crime was identified as a priority. To fulfill this priority, ICJIA has made available VOCA grant funding for core services and related support costs for victims of domestic violence. These funds will be made available to the Illinois Coalition Against Domestic Violence.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the date of period of performance start date, July 1, 2019 to be considered for funding.## Eligible ApplicantsThis solicitation is open to the Illinois Coalition Against Domestic Violence, 806 S. College Street, Springfield, Illinois, 62704.## DeadlineCompleted application materials must be emailed to NOFOemail@Illinois.gov by **11:59 p.m., Sunday, March 3, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of FFY17 Victims of Crime Act funds. A minimum of $21.3 million will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of July 1, 2019, through June 30, 2020.## Technical Assistance SessionN/A## Timeline|                             Task                             |       Date        || :----------------------------------------------------------: | :---------------: ||                         NOFO posted                          | February 1, 2019  ||           Technical Assistance Recording available           |        N/A        ||                     Notice of Intent due                     |        N/A        ||              NOFO question submission deadline               | February 25, 2019 ||                     **Applications due**                     | **March 3, 2019** || Budget Committee review/approval of recommended designations |     June 2019     ||                      Program start date                      |   July 1, 2019    |## ReportingRecipients must submit monthly/quarterly financial reports, monthly/quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Office of Victims of Crime portal at https://ovcpmt.ojp.gov/.## Required DocumentsThe following documents must be emailed to NOFOemail@Illinois.gov by the **11:59 p.m., Sunday, March 3, 2019,** deadline for application review.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icadv/ICADVapplication.pdf)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icadv/ICADVprogramnarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icadv/ICADVbudget.xls.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to NOFOemail@Illinois.gov until **11:59 p.m. on March 3, 2019.**## Contact InformationRonnie J. ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606NOFOemail@illinois.gov","fundingType":"nofo"},{"slug":"2019-icasa","legacy":true,"title":"Victims of Crime Act: Services for Victims of Sexual Assault Program","summary":"The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Services for Victims of Sexual Assault Program.  Grants will be made with Victims of Crime Act FFY17 funds. A total of $18,300,000 in funding is available through this solicitation for use over a period of 12 months. ","posted":"2019-01-29T00:00:00.000Z","expires":"2019-03-03T00:00:00.000Z","body":"[LINK TO NOFO](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icasa/ICASANOFO) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is requesting proposals for grants for the Services for Victims of Sexual Assault Program. Grants will be made with Victims of Crime Act FFY17 funds. A total of $18,300,000 in funding is available through this solicitation for use over a period of 12 months.**Application deadline:** Application materials must be received by **11:59 p.m. on Sunday, March 3, 2019.**## Program RequirementsAs part of the recommendations established by the Victim Services Ad Hoc Committee, the strengthening and expansion of core services for victims of crime was a priority. To fulfill this priority, ICJIA has made available VOCA grant funding for core services and related support costs for victims of sexual assault. These funds will be made available to the Illinois Coalition Against Sexual Assault.## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, https://grants.illinois.gov/portal/, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the date of period of performance start date, July 1, 2019 to be considered for funding.## Eligible ApplicantsThis solicitation is open to the Illinois Coalition Against Sexual Assault, 100 N. 16th Street, Springfield, Illinois, 62703.## DeadlineCompleted application materials must be emailed to NOFOaddress@Illinois.gov by **11:59 p.m., Sunday, March 3, 2019,** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this funding opportunity are a portion of Victims of Crime Act FFY17 funds. A minimum of $18,300,000 dollars will be made available through this funding opportunity.## Period of PerformanceFunding is available for the period of July 1, 2019, through June 30, 2020.## Technical Assistance SessionN/A## Timeline|                             Task                             |       Date        || :----------------------------------------------------------: | :---------------: ||                         NOFO posted                          | February 1, 2019  ||           Technical Assistance Recording available           |        N/A        ||                     Notice of Intent due                     |        N/A        ||              NOFO question submission deadline               | February 25, 2019 ||                     **Applications due**                     | **March 3, 2019** || Budget Committee review/approval of recommended designations |     June 2019     ||                      Program start date                      |   July 1, 2019    |## ReportingRecipients must submit monthly/quarterly financial reports, monthly/quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.In addition, funded programs will be required to report performance measures through the U.S. Office of Victims of Crime portal at https://ovcpmt.ojp.gov/.## Required DocumentsThe following documents must be emailed to NOFOemail@Illinois.gov by the **11:59 p.m., Sunday, March 3, 2019,** deadline for application review.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icasa/ICASAapplication.pdf)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icasa/ICASAprogramnarrative.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-icasa/ICASAbudget.xls)## QuestionsQuestions regarding this NOFO may be submitted to NOFOemail@Illinois.gov until **11:59 p.m. on March 3, 2019.** Questions and responses will be posted at https://grants.icjia.cloud.## Contact InformationRonnie J. ReichgeltIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606NOFOemail@illinois.gov","fundingType":"nofo"},{"slug":"2019-responsive-schools","legacy":true,"title":"Trauma Responsive Schools","summary":"The Illinois Criminal Justice Information Authority is posting this notice regarding grants for Trauma Responsive Schools. Grants will be made with state fiscal year 2019 bullying prevention funds. A total of $398,700 is available through June 30, 2019. ","posted":"2019-01-15T00:00:00.000Z","expires":"2019-02-15T00:00:00.000Z","body":"[View the Notice of Funding Opportunity](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-responsive-schools/TraumaResponsiveSchoolsNOFO.pdf) {.text-center .nofo-link}The Illinois Criminal Justice Information Authority is posting this notice regarding grants for Trauma Responsive Schools. Grants will be made with state fiscal year 2019 bullying prevention funds. A total of $398,700 is available through June 30, 2019.**Application deadline: 11:59 p.m. on February 15, 2019.**## Program DesignThe program design consists of an assessment and planning period to be completed by June 30, 2019. Developed by the National Child Traumatic Stress Network’s Treatment and Services Adaptation Center for Resilience, Hope, and Wellness in Schools and the Center for School Mental Health, the Trauma Responsive Schools Implementation Assessment (TRS-IA) provides a comprehensive assessment that can also be used by schools to document immediate and long-term changes. Grantees will assist schools in completing the assessment and developing an action plan with immediate and longer-term projects. Grantees may select to include additional tools in their assessment process. The action plan is due July 15, 2019 and must be approved by ICJIA by August 1, 2019. Contingent on satisfactory performance, future appropriation, and approval of the action plan, grantees may receive continuation funding for implementation of the action plan resulting from this notice.## Program Requirements- Identify multi-disciplinary school team members (team) for each proposed school.- Train each team on the project’s purpose and the assessment tool.- Develop a timeline that specifies team role/responsibilities to apply the assessment tool.- Conduct the assessment for each proposed school.- Using the assessment, develop an action plan for each proposed school that outlines key activities and responsible staff.- Submit action plan to ICJIA for approval by July 15, 2019.Additional Program Services can include all or some of the following:- Informational sessions for students, families, teachers, administrators, school staff and/or additional partners on trauma’s impact on learning and the creation of trauma-sensitive school environments through this grant- Data analysis## Eligibility InformationAgencies must be pre-qualified through the Grant Accountability and Transparency Act (GATA) Grantee Portal, www.grants.illinois.gov, to become eligible to apply for an award. Applicants must have completed the GATA pre-qualification process and received approval of their Internal Control Questionnaire (ICQ) by the date of period of performance start date, April 1, 2019 be considered for funding.This program design requires at least 5 years’ experience providing training and technical assistance to schools on bullying prevention, social and emotional learning, and/or trauma-aware climate initiatives. ICJIA assessed agencies with the experience and capacity to meet the program design and requirements and has identified the entities below due to their experience and capacity to implement program requirements in a short time frame. The following entities are eligible to apply:- Center for Childhood Resilience at Ann & Robert H. Lurie Children's Hospital of Chicago- Center for Rural Health at Southern Illinois University## DeadlineCompleted application materials must be emailed to CJA.TraumaAwareSchool@Illinois.gov by **11:59 p.m., February 15, 2019** to be considered for funding. Proposals will not be accepted by mail, fax, or in-person. Incomplete applications will not be reviewed. Late submissions will not be reviewed.## Available FundsGrants available through this notice will not exceed $398,700.## Period of PerformanceFunding is available for the period of April 1-June 30, 2019. Based on program performance and fund availability, the Authority may recommend allocation of funding to support an additional 33 months.## Timeline|                             Task                             |         Date          || :----------------------------------------------------------: | :-------------------: ||                         NOFO posted                          |   January 15, 2019    ||                     **Applications due**                     | **February 15, 2019** || Budget Committee review/approval of recommended designations |   February 28, 2019   ||                      Program start date                      |     April 1, 2019     |## ReportingRecipients must submit quarterly financial reports, quarterly progress reports, final financial and progress reports, and, if applicable, an annual audit report in accordance with the CFR Part 200 Uniform Requirements. Future awards and fund drawdowns may be withheld if reports are delinquent.## Required DocumentsThe following documents must be emailed to CJA.TraumaAwareSchool@Illinois.gov by the 11:59 p.m., February 15, 2019 for application review. Click the links below to download copies.- [Completed and signed Uniform State Grant Application (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-responsive-schools/TraumaResponsiveAPPLICATION.docx)- [Completed Program Narrative (Word)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-responsive-schools/TraumaResponsivePROGRAMNARRATIVE.docx)- [Completed Budget/Budget Narrative (Excel)](https://archive.icjia-api.cloud/files/icjia/gata/materials/funding/2019-responsive-schools/TraumaResponsiveSchoolsBUDGET.xlsx)## QuestionsQuestions regarding this NOFO may be submitted to CJA.TraumaAwareSchool@Illinois.gov.## Contact InformationReshma DesaiIllinois Criminal Justice Information Authority300 West Adams, Suite 200Chicago, IL 60606CJA.TraumaAwareSchool@Illinois.gov","fundingType":"nofo"}]